/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize)
        };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {

pub const FP_PREC_24B: u32 = 0;
pub const FP_PREC_53B: u32 = 2;
pub const FP_PREC_64B: u32 = 3;
pub const FP_RND_NEAR: u32 = 0;
pub const FP_RND_DOWN: u32 = 1;
pub const FP_RND_UP: u32 = 2;
pub const FP_CHOP: u32 = 3;
pub const FP_STATE_BYTES: u32 = 512;
pub const _X86_INSTRUCTION_STATE_MAX_INSN_BYTES: u32 = 2380;
pub const _X86_INSTRUCTION_STATE_CACHELINE_SIZE: u32 = 64;
pub const __LASTBRANCH_MAX: u32 = 32;
pub const USE_CLANG_STDDEF: u32 = 0;
pub const SIGEV_NONE: u32 = 0;
pub const SIGEV_SIGNAL: u32 = 1;
pub const SIGEV_THREAD: u32 = 3;
pub const SIGEV_KEVENT: u32 = 4;
pub const ILL_NOOP: u32 = 0;
pub const ILL_ILLOPC: u32 = 1;
pub const ILL_ILLTRP: u32 = 2;
pub const ILL_PRVOPC: u32 = 3;
pub const ILL_ILLOPN: u32 = 4;
pub const ILL_ILLADR: u32 = 5;
pub const ILL_PRVREG: u32 = 6;
pub const ILL_COPROC: u32 = 7;
pub const ILL_BADSTK: u32 = 8;
pub const FPE_NOOP: u32 = 0;
pub const FPE_FLTDIV: u32 = 1;
pub const FPE_FLTOVF: u32 = 2;
pub const FPE_FLTUND: u32 = 3;
pub const FPE_FLTRES: u32 = 4;
pub const FPE_FLTINV: u32 = 5;
pub const FPE_FLTSUB: u32 = 6;
pub const FPE_INTDIV: u32 = 7;
pub const FPE_INTOVF: u32 = 8;
pub const SEGV_NOOP: u32 = 0;
pub const SEGV_MAPERR: u32 = 1;
pub const SEGV_ACCERR: u32 = 2;
pub const BUS_NOOP: u32 = 0;
pub const BUS_ADRALN: u32 = 1;
pub const BUS_ADRERR: u32 = 2;
pub const BUS_OBJERR: u32 = 3;
pub const TRAP_BRKPT: u32 = 1;
pub const TRAP_TRACE: u32 = 2;
pub const CLD_NOOP: u32 = 0;
pub const CLD_EXITED: u32 = 1;
pub const CLD_KILLED: u32 = 2;
pub const CLD_DUMPED: u32 = 3;
pub const CLD_TRAPPED: u32 = 4;
pub const CLD_STOPPED: u32 = 5;
pub const CLD_CONTINUED: u32 = 6;
pub const POLL_IN: u32 = 1;
pub const POLL_OUT: u32 = 2;
pub const POLL_MSG: u32 = 3;
pub const POLL_ERR: u32 = 4;
pub const POLL_PRI: u32 = 5;
pub const POLL_HUP: u32 = 6;
pub const SA_ONSTACK: u32 = 1;
pub const SA_RESTART: u32 = 2;
pub const SA_RESETHAND: u32 = 4;
pub const SA_NOCLDSTOP: u32 = 8;
pub const SA_NODEFER: u32 = 16;
pub const SA_NOCLDWAIT: u32 = 32;
pub const SA_SIGINFO: u32 = 64;
pub const SA_USERTRAMP: u32 = 256;
pub const SA_64REGSET: u32 = 512;
pub const SA_USERSPACE_MASK: u32 = 127;
pub const SIG_BLOCK: u32 = 1;
pub const SIG_UNBLOCK: u32 = 2;
pub const SIG_SETMASK: u32 = 3;
pub const SI_USER: u32 = 65537;
pub const SI_QUEUE: u32 = 65538;
pub const SI_TIMER: u32 = 65539;
pub const SI_ASYNCIO: u32 = 65540;
pub const SI_MESGQ: u32 = 65541;
pub const SS_ONSTACK: u32 = 1;
pub const SS_DISABLE: u32 = 4;
pub const MINSIGSTKSZ: u32 = 32768;
pub const SIGSTKSZ: u32 = 131072;
pub const SV_ONSTACK: u32 = 1;
pub const SV_INTERRUPT: u32 = 2;
pub const SV_RESETHAND: u32 = 4;
pub const SV_NODEFER: u32 = 16;
pub const SV_NOCLDSTOP: u32 = 8;
pub const SV_SIGINFO: u32 = 64;
pub type wchar_t = ::std::os::raw::c_int;
pub type max_align_t = u128;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GoString_ {
    pub p: *const ::std::os::raw::c_char,
    pub n: isize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GoString_"][::std::mem::size_of::<_GoString_>() - 16usize];
    ["Alignment of _GoString_"][::std::mem::align_of::<_GoString_>() - 8usize];
    ["Offset of field: _GoString_::p"][::std::mem::offset_of!(_GoString_, p) - 0usize];
    ["Offset of field: _GoString_::n"][::std::mem::offset_of!(_GoString_, n) - 8usize];
};
unsafe extern "C" {
    pub fn _GoStringLen(s: _GoString_) -> usize;
}
unsafe extern "C" {
    pub fn _GoStringPtr(s: _GoString_) -> *const ::std::os::raw::c_char;
}
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast8_t = i8;
pub type int_fast16_t = i16;
pub type int_fast32_t = i32;
pub type int_fast64_t = i64;
pub type uint_fast8_t = u8;
pub type uint_fast16_t = u16;
pub type uint_fast32_t = u32;
pub type uint_fast64_t = u64;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __uint64_t = ::std::os::raw::c_ulonglong;
pub type __darwin_intptr_t = ::std::os::raw::c_long;
pub type __darwin_natural_t = ::std::os::raw::c_uint;
pub type __darwin_ct_rune_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t {
    pub __mbstate8: [::std::os::raw::c_char; 128usize],
    pub _mbstateL: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::std::mem::size_of::<__mbstate_t>() - 128usize];
    ["Alignment of __mbstate_t"][::std::mem::align_of::<__mbstate_t>() - 8usize];
    ["Offset of field: __mbstate_t::__mbstate8"]
        [::std::mem::offset_of!(__mbstate_t, __mbstate8) - 0usize];
    ["Offset of field: __mbstate_t::_mbstateL"]
        [::std::mem::offset_of!(__mbstate_t, _mbstateL) - 0usize];
};
pub type __darwin_mbstate_t = __mbstate_t;
pub type __darwin_ptrdiff_t = ::std::os::raw::c_long;
pub type __darwin_size_t = ::std::os::raw::c_ulong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_wchar_t = ::std::os::raw::c_int;
pub type __darwin_rune_t = __darwin_wchar_t;
pub type __darwin_wint_t = ::std::os::raw::c_int;
pub type __darwin_clock_t = ::std::os::raw::c_ulong;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_ssize_t = ::std::os::raw::c_long;
pub type __darwin_time_t = ::std::os::raw::c_long;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_fsblkcnt_t = ::std::os::raw::c_uint;
pub type __darwin_fsfilcnt_t = ::std::os::raw::c_uint;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_id_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_ino_t = __darwin_ino64_t;
pub type __darwin_mach_port_name_t = __darwin_natural_t;
pub type __darwin_mach_port_t = __darwin_mach_port_name_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_sigset_t = __uint32_t;
pub type __darwin_suseconds_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
pub type __darwin_useconds_t = __uint32_t;
pub type __darwin_uuid_t = [::std::os::raw::c_uchar; 16usize];
pub type __darwin_uuid_string_t = [::std::os::raw::c_char; 37usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_pthread_handler_rec {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __arg: *mut ::std::os::raw::c_void,
    pub __next: *mut __darwin_pthread_handler_rec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_pthread_handler_rec"]
        [::std::mem::size_of::<__darwin_pthread_handler_rec>() - 24usize];
    ["Alignment of __darwin_pthread_handler_rec"]
        [::std::mem::align_of::<__darwin_pthread_handler_rec>() - 8usize];
    ["Offset of field: __darwin_pthread_handler_rec::__routine"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __routine) - 0usize];
    ["Offset of field: __darwin_pthread_handler_rec::__arg"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __arg) - 8usize];
    ["Offset of field: __darwin_pthread_handler_rec::__next"]
        [::std::mem::offset_of!(__darwin_pthread_handler_rec, __next) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_attr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_attr_t"][::std::mem::size_of::<_opaque_pthread_attr_t>() - 64usize];
    ["Alignment of _opaque_pthread_attr_t"]
        [::std::mem::align_of::<_opaque_pthread_attr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_attr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_attr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_attr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_attr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_cond_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 40usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_cond_t"][::std::mem::size_of::<_opaque_pthread_cond_t>() - 48usize];
    ["Alignment of _opaque_pthread_cond_t"]
        [::std::mem::align_of::<_opaque_pthread_cond_t>() - 8usize];
    ["Offset of field: _opaque_pthread_cond_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_cond_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_cond_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_cond_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_condattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_condattr_t"]
        [::std::mem::size_of::<_opaque_pthread_condattr_t>() - 16usize];
    ["Alignment of _opaque_pthread_condattr_t"]
        [::std::mem::align_of::<_opaque_pthread_condattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_condattr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_condattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_condattr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_condattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_mutex_t"][::std::mem::size_of::<_opaque_pthread_mutex_t>() - 64usize];
    ["Alignment of _opaque_pthread_mutex_t"]
        [::std::mem::align_of::<_opaque_pthread_mutex_t>() - 8usize];
    ["Offset of field: _opaque_pthread_mutex_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_mutex_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_mutex_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_mutex_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutexattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_mutexattr_t"]
        [::std::mem::size_of::<_opaque_pthread_mutexattr_t>() - 16usize];
    ["Alignment of _opaque_pthread_mutexattr_t"]
        [::std::mem::align_of::<_opaque_pthread_mutexattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_mutexattr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_mutexattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_mutexattr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_mutexattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_once_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_once_t"][::std::mem::size_of::<_opaque_pthread_once_t>() - 16usize];
    ["Alignment of _opaque_pthread_once_t"]
        [::std::mem::align_of::<_opaque_pthread_once_t>() - 8usize];
    ["Offset of field: _opaque_pthread_once_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_once_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_once_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_once_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlock_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 192usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_rwlock_t"]
        [::std::mem::size_of::<_opaque_pthread_rwlock_t>() - 200usize];
    ["Alignment of _opaque_pthread_rwlock_t"]
        [::std::mem::align_of::<_opaque_pthread_rwlock_t>() - 8usize];
    ["Offset of field: _opaque_pthread_rwlock_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_rwlock_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_rwlock_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_rwlock_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlockattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_rwlockattr_t"]
        [::std::mem::size_of::<_opaque_pthread_rwlockattr_t>() - 24usize];
    ["Alignment of _opaque_pthread_rwlockattr_t"]
        [::std::mem::align_of::<_opaque_pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: _opaque_pthread_rwlockattr_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_rwlockattr_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_rwlockattr_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_rwlockattr_t, __opaque) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_t {
    pub __sig: ::std::os::raw::c_long,
    pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
    pub __opaque: [::std::os::raw::c_char; 8176usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _opaque_pthread_t"][::std::mem::size_of::<_opaque_pthread_t>() - 8192usize];
    ["Alignment of _opaque_pthread_t"][::std::mem::align_of::<_opaque_pthread_t>() - 8usize];
    ["Offset of field: _opaque_pthread_t::__sig"]
        [::std::mem::offset_of!(_opaque_pthread_t, __sig) - 0usize];
    ["Offset of field: _opaque_pthread_t::__cleanup_stack"]
        [::std::mem::offset_of!(_opaque_pthread_t, __cleanup_stack) - 8usize];
    ["Offset of field: _opaque_pthread_t::__opaque"]
        [::std::mem::offset_of!(_opaque_pthread_t, __opaque) - 16usize];
};
pub type __darwin_pthread_attr_t = _opaque_pthread_attr_t;
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_condattr_t = _opaque_pthread_condattr_t;
pub type __darwin_pthread_key_t = ::std::os::raw::c_ulong;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type __darwin_pthread_mutexattr_t = _opaque_pthread_mutexattr_t;
pub type __darwin_pthread_once_t = _opaque_pthread_once_t;
pub type __darwin_pthread_rwlock_t = _opaque_pthread_rwlock_t;
pub type __darwin_pthread_rwlockattr_t = _opaque_pthread_rwlockattr_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type intmax_t = ::std::os::raw::c_long;
pub type uintmax_t = ::std::os::raw::c_ulong;
pub type __darwin_nl_item = ::std::os::raw::c_int;
pub type __darwin_wctrans_t = ::std::os::raw::c_int;
pub type __darwin_wctype_t = __uint32_t;
pub type sig_atomic_t = ::std::os::raw::c_int;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulonglong;
pub type register_t = i64;
pub type user_addr_t = u_int64_t;
pub type user_size_t = u_int64_t;
pub type user_ssize_t = i64;
pub type user_long_t = i64;
pub type user_ulong_t = u_int64_t;
pub type user_time_t = i64;
pub type user_off_t = i64;
pub type syscall_arg_t = u_int64_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_i386_thread_state {
    pub __eax: ::std::os::raw::c_uint,
    pub __ebx: ::std::os::raw::c_uint,
    pub __ecx: ::std::os::raw::c_uint,
    pub __edx: ::std::os::raw::c_uint,
    pub __edi: ::std::os::raw::c_uint,
    pub __esi: ::std::os::raw::c_uint,
    pub __ebp: ::std::os::raw::c_uint,
    pub __esp: ::std::os::raw::c_uint,
    pub __ss: ::std::os::raw::c_uint,
    pub __eflags: ::std::os::raw::c_uint,
    pub __eip: ::std::os::raw::c_uint,
    pub __cs: ::std::os::raw::c_uint,
    pub __ds: ::std::os::raw::c_uint,
    pub __es: ::std::os::raw::c_uint,
    pub __fs: ::std::os::raw::c_uint,
    pub __gs: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_i386_thread_state"]
        [::std::mem::size_of::<__darwin_i386_thread_state>() - 64usize];
    ["Alignment of __darwin_i386_thread_state"]
        [::std::mem::align_of::<__darwin_i386_thread_state>() - 4usize];
    ["Offset of field: __darwin_i386_thread_state::__eax"]
        [::std::mem::offset_of!(__darwin_i386_thread_state, __eax) - 0usize];
    ["Offset of field: __darwin_i386_thread_state::__ebx"]
        [::std::mem::offset_of!(__darwin_i386_thread_state, __ebx) - 4usize];
    ["Offset of field: __darwin_i386_thread_state::__ecx"]
        [::std::mem::offset_of!(__darwin_i386_thread_state, __ecx) - 8usize];
    ["Offset of field: __darwin_i386_thread_state::__edx"]
        [::std::mem::offset_of!(__darwin_i386_thread_state, __edx) - 12usize];
    ["Offset of field: __darwin_i386_thread_state::__edi"]
        [::std::mem::offset_of!(__darwin_i386_thread_state, __edi) - 16usize];
    ["Offset of field: __darwin_i386_thread_state::__esi"]
        [::std::mem::offset_of!(__darwin_i386_thread_state, __esi) - 20usize];
    ["Offset of field: __darwin_i386_thread_state::__ebp"]
        [::std::mem::offset_of!(__darwin_i386_thread_state, __ebp) - 24usize];
    ["Offset of field: __darwin_i386_thread_state::__esp"]
        [::std::mem::offset_of!(__darwin_i386_thread_state, __esp) - 28usize];
    ["Offset of field: __darwin_i386_thread_state::__ss"]
        [::std::mem::offset_of!(__darwin_i386_thread_state, __ss) - 32usize];
    ["Offset of field: __darwin_i386_thread_state::__eflags"]
        [::std::mem::offset_of!(__darwin_i386_thread_state, __eflags) - 36usize];
    ["Offset of field: __darwin_i386_thread_state::__eip"]
        [::std::mem::offset_of!(__darwin_i386_thread_state, __eip) - 40usize];
    ["Offset of field: __darwin_i386_thread_state::__cs"]
        [::std::mem::offset_of!(__darwin_i386_thread_state, __cs) - 44usize];
    ["Offset of field: __darwin_i386_thread_state::__ds"]
        [::std::mem::offset_of!(__darwin_i386_thread_state, __ds) - 48usize];
    ["Offset of field: __darwin_i386_thread_state::__es"]
        [::std::mem::offset_of!(__darwin_i386_thread_state, __es) - 52usize];
    ["Offset of field: __darwin_i386_thread_state::__fs"]
        [::std::mem::offset_of!(__darwin_i386_thread_state, __fs) - 56usize];
    ["Offset of field: __darwin_i386_thread_state::__gs"]
        [::std::mem::offset_of!(__darwin_i386_thread_state, __gs) - 60usize];
};
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_fp_control {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_fp_control"][::std::mem::size_of::<__darwin_fp_control>() - 2usize];
    ["Alignment of __darwin_fp_control"][::std::mem::align_of::<__darwin_fp_control>() - 2usize];
};
impl __darwin_fp_control {
    #[inline]
    pub fn __invalid(&self) -> ::std::os::raw::c_ushort {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set___invalid(&mut self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __invalid_raw(this: *const Self) -> ::std::os::raw::c_ushort {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set___invalid_raw(this: *mut Self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __denorm(&self) -> ::std::os::raw::c_ushort {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set___denorm(&mut self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __denorm_raw(this: *const Self) -> ::std::os::raw::c_ushort {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set___denorm_raw(this: *mut Self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __zdiv(&self) -> ::std::os::raw::c_ushort {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set___zdiv(&mut self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __zdiv_raw(this: *const Self) -> ::std::os::raw::c_ushort {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set___zdiv_raw(this: *mut Self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __ovrfl(&self) -> ::std::os::raw::c_ushort {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set___ovrfl(&mut self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __ovrfl_raw(this: *const Self) -> ::std::os::raw::c_ushort {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set___ovrfl_raw(this: *mut Self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __undfl(&self) -> ::std::os::raw::c_ushort {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set___undfl(&mut self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __undfl_raw(this: *const Self) -> ::std::os::raw::c_ushort {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set___undfl_raw(this: *mut Self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __precis(&self) -> ::std::os::raw::c_ushort {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set___precis(&mut self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __precis_raw(this: *const Self) -> ::std::os::raw::c_ushort {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set___precis_raw(this: *mut Self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __pc(&self) -> ::std::os::raw::c_ushort {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set___pc(&mut self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __pc_raw(this: *const Self) -> ::std::os::raw::c_ushort {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                2u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set___pc_raw(this: *mut Self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __rc(&self) -> ::std::os::raw::c_ushort {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set___rc(&mut self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __rc_raw(this: *const Self) -> ::std::os::raw::c_ushort {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                10usize,
                2u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set___rc_raw(this: *mut Self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        __invalid: ::std::os::raw::c_ushort,
        __denorm: ::std::os::raw::c_ushort,
        __zdiv: ::std::os::raw::c_ushort,
        __ovrfl: ::std::os::raw::c_ushort,
        __undfl: ::std::os::raw::c_ushort,
        __precis: ::std::os::raw::c_ushort,
        __pc: ::std::os::raw::c_ushort,
        __rc: ::std::os::raw::c_ushort,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let __invalid: u16 = unsafe { ::std::mem::transmute(__invalid) };
            __invalid as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let __denorm: u16 = unsafe { ::std::mem::transmute(__denorm) };
            __denorm as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let __zdiv: u16 = unsafe { ::std::mem::transmute(__zdiv) };
            __zdiv as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let __ovrfl: u16 = unsafe { ::std::mem::transmute(__ovrfl) };
            __ovrfl as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let __undfl: u16 = unsafe { ::std::mem::transmute(__undfl) };
            __undfl as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let __precis: u16 = unsafe { ::std::mem::transmute(__precis) };
            __precis as u64
        });
        __bindgen_bitfield_unit.set(8usize, 2u8, {
            let __pc: u16 = unsafe { ::std::mem::transmute(__pc) };
            __pc as u64
        });
        __bindgen_bitfield_unit.set(10usize, 2u8, {
            let __rc: u16 = unsafe { ::std::mem::transmute(__rc) };
            __rc as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type __darwin_fp_control_t = __darwin_fp_control;
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_fp_status {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_fp_status"][::std::mem::size_of::<__darwin_fp_status>() - 2usize];
    ["Alignment of __darwin_fp_status"][::std::mem::align_of::<__darwin_fp_status>() - 2usize];
};
impl __darwin_fp_status {
    #[inline]
    pub fn __invalid(&self) -> ::std::os::raw::c_ushort {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set___invalid(&mut self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __invalid_raw(this: *const Self) -> ::std::os::raw::c_ushort {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set___invalid_raw(this: *mut Self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __denorm(&self) -> ::std::os::raw::c_ushort {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set___denorm(&mut self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __denorm_raw(this: *const Self) -> ::std::os::raw::c_ushort {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set___denorm_raw(this: *mut Self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __zdiv(&self) -> ::std::os::raw::c_ushort {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set___zdiv(&mut self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __zdiv_raw(this: *const Self) -> ::std::os::raw::c_ushort {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set___zdiv_raw(this: *mut Self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __ovrfl(&self) -> ::std::os::raw::c_ushort {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set___ovrfl(&mut self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __ovrfl_raw(this: *const Self) -> ::std::os::raw::c_ushort {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set___ovrfl_raw(this: *mut Self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __undfl(&self) -> ::std::os::raw::c_ushort {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set___undfl(&mut self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __undfl_raw(this: *const Self) -> ::std::os::raw::c_ushort {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set___undfl_raw(this: *mut Self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __precis(&self) -> ::std::os::raw::c_ushort {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set___precis(&mut self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __precis_raw(this: *const Self) -> ::std::os::raw::c_ushort {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set___precis_raw(this: *mut Self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __stkflt(&self) -> ::std::os::raw::c_ushort {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set___stkflt(&mut self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __stkflt_raw(this: *const Self) -> ::std::os::raw::c_ushort {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                6usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set___stkflt_raw(this: *mut Self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __errsumm(&self) -> ::std::os::raw::c_ushort {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set___errsumm(&mut self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __errsumm_raw(this: *const Self) -> ::std::os::raw::c_ushort {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set___errsumm_raw(this: *mut Self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __c0(&self) -> ::std::os::raw::c_ushort {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set___c0(&mut self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __c0_raw(this: *const Self) -> ::std::os::raw::c_ushort {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set___c0_raw(this: *mut Self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __c1(&self) -> ::std::os::raw::c_ushort {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set___c1(&mut self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __c1_raw(this: *const Self) -> ::std::os::raw::c_ushort {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                9usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set___c1_raw(this: *mut Self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                9usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __c2(&self) -> ::std::os::raw::c_ushort {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set___c2(&mut self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __c2_raw(this: *const Self) -> ::std::os::raw::c_ushort {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                10usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set___c2_raw(this: *mut Self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __tos(&self) -> ::std::os::raw::c_ushort {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set___tos(&mut self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __tos_raw(this: *const Self) -> ::std::os::raw::c_ushort {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                11usize,
                3u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set___tos_raw(this: *mut Self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                11usize,
                3u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __c3(&self) -> ::std::os::raw::c_ushort {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set___c3(&mut self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __c3_raw(this: *const Self) -> ::std::os::raw::c_ushort {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                14usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set___c3_raw(this: *mut Self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                14usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __busy(&self) -> ::std::os::raw::c_ushort {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set___busy(&mut self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __busy_raw(this: *const Self) -> ::std::os::raw::c_ushort {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                15usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set___busy_raw(this: *mut Self, val: ::std::os::raw::c_ushort) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                15usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        __invalid: ::std::os::raw::c_ushort,
        __denorm: ::std::os::raw::c_ushort,
        __zdiv: ::std::os::raw::c_ushort,
        __ovrfl: ::std::os::raw::c_ushort,
        __undfl: ::std::os::raw::c_ushort,
        __precis: ::std::os::raw::c_ushort,
        __stkflt: ::std::os::raw::c_ushort,
        __errsumm: ::std::os::raw::c_ushort,
        __c0: ::std::os::raw::c_ushort,
        __c1: ::std::os::raw::c_ushort,
        __c2: ::std::os::raw::c_ushort,
        __tos: ::std::os::raw::c_ushort,
        __c3: ::std::os::raw::c_ushort,
        __busy: ::std::os::raw::c_ushort,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let __invalid: u16 = unsafe { ::std::mem::transmute(__invalid) };
            __invalid as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let __denorm: u16 = unsafe { ::std::mem::transmute(__denorm) };
            __denorm as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let __zdiv: u16 = unsafe { ::std::mem::transmute(__zdiv) };
            __zdiv as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let __ovrfl: u16 = unsafe { ::std::mem::transmute(__ovrfl) };
            __ovrfl as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let __undfl: u16 = unsafe { ::std::mem::transmute(__undfl) };
            __undfl as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let __precis: u16 = unsafe { ::std::mem::transmute(__precis) };
            __precis as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let __stkflt: u16 = unsafe { ::std::mem::transmute(__stkflt) };
            __stkflt as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let __errsumm: u16 = unsafe { ::std::mem::transmute(__errsumm) };
            __errsumm as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let __c0: u16 = unsafe { ::std::mem::transmute(__c0) };
            __c0 as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let __c1: u16 = unsafe { ::std::mem::transmute(__c1) };
            __c1 as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let __c2: u16 = unsafe { ::std::mem::transmute(__c2) };
            __c2 as u64
        });
        __bindgen_bitfield_unit.set(11usize, 3u8, {
            let __tos: u16 = unsafe { ::std::mem::transmute(__tos) };
            __tos as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let __c3: u16 = unsafe { ::std::mem::transmute(__c3) };
            __c3 as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let __busy: u16 = unsafe { ::std::mem::transmute(__busy) };
            __busy as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type __darwin_fp_status_t = __darwin_fp_status;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_mmst_reg {
    pub __mmst_reg: [::std::os::raw::c_char; 10usize],
    pub __mmst_rsrv: [::std::os::raw::c_char; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_mmst_reg"][::std::mem::size_of::<__darwin_mmst_reg>() - 16usize];
    ["Alignment of __darwin_mmst_reg"][::std::mem::align_of::<__darwin_mmst_reg>() - 1usize];
    ["Offset of field: __darwin_mmst_reg::__mmst_reg"]
        [::std::mem::offset_of!(__darwin_mmst_reg, __mmst_reg) - 0usize];
    ["Offset of field: __darwin_mmst_reg::__mmst_rsrv"]
        [::std::mem::offset_of!(__darwin_mmst_reg, __mmst_rsrv) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_xmm_reg {
    pub __xmm_reg: [::std::os::raw::c_char; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_xmm_reg"][::std::mem::size_of::<__darwin_xmm_reg>() - 16usize];
    ["Alignment of __darwin_xmm_reg"][::std::mem::align_of::<__darwin_xmm_reg>() - 1usize];
    ["Offset of field: __darwin_xmm_reg::__xmm_reg"]
        [::std::mem::offset_of!(__darwin_xmm_reg, __xmm_reg) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_ymm_reg {
    pub __ymm_reg: [::std::os::raw::c_char; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_ymm_reg"][::std::mem::size_of::<__darwin_ymm_reg>() - 32usize];
    ["Alignment of __darwin_ymm_reg"][::std::mem::align_of::<__darwin_ymm_reg>() - 1usize];
    ["Offset of field: __darwin_ymm_reg::__ymm_reg"]
        [::std::mem::offset_of!(__darwin_ymm_reg, __ymm_reg) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_zmm_reg {
    pub __zmm_reg: [::std::os::raw::c_char; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_zmm_reg"][::std::mem::size_of::<__darwin_zmm_reg>() - 64usize];
    ["Alignment of __darwin_zmm_reg"][::std::mem::align_of::<__darwin_zmm_reg>() - 1usize];
    ["Offset of field: __darwin_zmm_reg::__zmm_reg"]
        [::std::mem::offset_of!(__darwin_zmm_reg, __zmm_reg) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_opmask_reg {
    pub __opmask_reg: [::std::os::raw::c_char; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_opmask_reg"][::std::mem::size_of::<__darwin_opmask_reg>() - 8usize];
    ["Alignment of __darwin_opmask_reg"][::std::mem::align_of::<__darwin_opmask_reg>() - 1usize];
    ["Offset of field: __darwin_opmask_reg::__opmask_reg"]
        [::std::mem::offset_of!(__darwin_opmask_reg, __opmask_reg) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_i386_float_state {
    pub __fpu_reserved: [::std::os::raw::c_int; 2usize],
    pub __fpu_fcw: __darwin_fp_control,
    pub __fpu_fsw: __darwin_fp_status,
    pub __fpu_ftw: __uint8_t,
    pub __fpu_rsrv1: __uint8_t,
    pub __fpu_fop: __uint16_t,
    pub __fpu_ip: __uint32_t,
    pub __fpu_cs: __uint16_t,
    pub __fpu_rsrv2: __uint16_t,
    pub __fpu_dp: __uint32_t,
    pub __fpu_ds: __uint16_t,
    pub __fpu_rsrv3: __uint16_t,
    pub __fpu_mxcsr: __uint32_t,
    pub __fpu_mxcsrmask: __uint32_t,
    pub __fpu_stmm0: __darwin_mmst_reg,
    pub __fpu_stmm1: __darwin_mmst_reg,
    pub __fpu_stmm2: __darwin_mmst_reg,
    pub __fpu_stmm3: __darwin_mmst_reg,
    pub __fpu_stmm4: __darwin_mmst_reg,
    pub __fpu_stmm5: __darwin_mmst_reg,
    pub __fpu_stmm6: __darwin_mmst_reg,
    pub __fpu_stmm7: __darwin_mmst_reg,
    pub __fpu_xmm0: __darwin_xmm_reg,
    pub __fpu_xmm1: __darwin_xmm_reg,
    pub __fpu_xmm2: __darwin_xmm_reg,
    pub __fpu_xmm3: __darwin_xmm_reg,
    pub __fpu_xmm4: __darwin_xmm_reg,
    pub __fpu_xmm5: __darwin_xmm_reg,
    pub __fpu_xmm6: __darwin_xmm_reg,
    pub __fpu_xmm7: __darwin_xmm_reg,
    pub __fpu_rsrv4: [::std::os::raw::c_char; 224usize],
    pub __fpu_reserved1: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_i386_float_state"]
        [::std::mem::size_of::<__darwin_i386_float_state>() - 524usize];
    ["Alignment of __darwin_i386_float_state"]
        [::std::mem::align_of::<__darwin_i386_float_state>() - 4usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_reserved"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_reserved) - 0usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_fcw"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_fcw) - 8usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_fsw"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_fsw) - 10usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_ftw"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_ftw) - 12usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_rsrv1"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_rsrv1) - 13usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_fop"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_fop) - 14usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_ip"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_ip) - 16usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_cs"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_cs) - 20usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_rsrv2"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_rsrv2) - 22usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_dp"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_dp) - 24usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_ds"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_ds) - 28usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_rsrv3"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_rsrv3) - 30usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_mxcsr"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_mxcsr) - 32usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_mxcsrmask"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_mxcsrmask) - 36usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_stmm0"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_stmm0) - 40usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_stmm1"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_stmm1) - 56usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_stmm2"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_stmm2) - 72usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_stmm3"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_stmm3) - 88usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_stmm4"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_stmm4) - 104usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_stmm5"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_stmm5) - 120usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_stmm6"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_stmm6) - 136usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_stmm7"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_stmm7) - 152usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_xmm0"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_xmm0) - 168usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_xmm1"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_xmm1) - 184usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_xmm2"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_xmm2) - 200usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_xmm3"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_xmm3) - 216usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_xmm4"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_xmm4) - 232usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_xmm5"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_xmm5) - 248usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_xmm6"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_xmm6) - 264usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_xmm7"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_xmm7) - 280usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_rsrv4"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_rsrv4) - 296usize];
    ["Offset of field: __darwin_i386_float_state::__fpu_reserved1"]
        [::std::mem::offset_of!(__darwin_i386_float_state, __fpu_reserved1) - 520usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_i386_avx_state {
    pub __fpu_reserved: [::std::os::raw::c_int; 2usize],
    pub __fpu_fcw: __darwin_fp_control,
    pub __fpu_fsw: __darwin_fp_status,
    pub __fpu_ftw: __uint8_t,
    pub __fpu_rsrv1: __uint8_t,
    pub __fpu_fop: __uint16_t,
    pub __fpu_ip: __uint32_t,
    pub __fpu_cs: __uint16_t,
    pub __fpu_rsrv2: __uint16_t,
    pub __fpu_dp: __uint32_t,
    pub __fpu_ds: __uint16_t,
    pub __fpu_rsrv3: __uint16_t,
    pub __fpu_mxcsr: __uint32_t,
    pub __fpu_mxcsrmask: __uint32_t,
    pub __fpu_stmm0: __darwin_mmst_reg,
    pub __fpu_stmm1: __darwin_mmst_reg,
    pub __fpu_stmm2: __darwin_mmst_reg,
    pub __fpu_stmm3: __darwin_mmst_reg,
    pub __fpu_stmm4: __darwin_mmst_reg,
    pub __fpu_stmm5: __darwin_mmst_reg,
    pub __fpu_stmm6: __darwin_mmst_reg,
    pub __fpu_stmm7: __darwin_mmst_reg,
    pub __fpu_xmm0: __darwin_xmm_reg,
    pub __fpu_xmm1: __darwin_xmm_reg,
    pub __fpu_xmm2: __darwin_xmm_reg,
    pub __fpu_xmm3: __darwin_xmm_reg,
    pub __fpu_xmm4: __darwin_xmm_reg,
    pub __fpu_xmm5: __darwin_xmm_reg,
    pub __fpu_xmm6: __darwin_xmm_reg,
    pub __fpu_xmm7: __darwin_xmm_reg,
    pub __fpu_rsrv4: [::std::os::raw::c_char; 224usize],
    pub __fpu_reserved1: ::std::os::raw::c_int,
    pub __avx_reserved1: [::std::os::raw::c_char; 64usize],
    pub __fpu_ymmh0: __darwin_xmm_reg,
    pub __fpu_ymmh1: __darwin_xmm_reg,
    pub __fpu_ymmh2: __darwin_xmm_reg,
    pub __fpu_ymmh3: __darwin_xmm_reg,
    pub __fpu_ymmh4: __darwin_xmm_reg,
    pub __fpu_ymmh5: __darwin_xmm_reg,
    pub __fpu_ymmh6: __darwin_xmm_reg,
    pub __fpu_ymmh7: __darwin_xmm_reg,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_i386_avx_state"]
        [::std::mem::size_of::<__darwin_i386_avx_state>() - 716usize];
    ["Alignment of __darwin_i386_avx_state"]
        [::std::mem::align_of::<__darwin_i386_avx_state>() - 4usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_reserved"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_reserved) - 0usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_fcw"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_fcw) - 8usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_fsw"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_fsw) - 10usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_ftw"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_ftw) - 12usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_rsrv1"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_rsrv1) - 13usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_fop"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_fop) - 14usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_ip"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_ip) - 16usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_cs"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_cs) - 20usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_rsrv2"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_rsrv2) - 22usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_dp"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_dp) - 24usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_ds"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_ds) - 28usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_rsrv3"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_rsrv3) - 30usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_mxcsr"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_mxcsr) - 32usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_mxcsrmask"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_mxcsrmask) - 36usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_stmm0"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_stmm0) - 40usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_stmm1"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_stmm1) - 56usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_stmm2"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_stmm2) - 72usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_stmm3"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_stmm3) - 88usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_stmm4"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_stmm4) - 104usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_stmm5"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_stmm5) - 120usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_stmm6"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_stmm6) - 136usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_stmm7"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_stmm7) - 152usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_xmm0"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_xmm0) - 168usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_xmm1"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_xmm1) - 184usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_xmm2"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_xmm2) - 200usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_xmm3"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_xmm3) - 216usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_xmm4"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_xmm4) - 232usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_xmm5"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_xmm5) - 248usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_xmm6"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_xmm6) - 264usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_xmm7"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_xmm7) - 280usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_rsrv4"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_rsrv4) - 296usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_reserved1"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_reserved1) - 520usize];
    ["Offset of field: __darwin_i386_avx_state::__avx_reserved1"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __avx_reserved1) - 524usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_ymmh0"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_ymmh0) - 588usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_ymmh1"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_ymmh1) - 604usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_ymmh2"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_ymmh2) - 620usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_ymmh3"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_ymmh3) - 636usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_ymmh4"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_ymmh4) - 652usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_ymmh5"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_ymmh5) - 668usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_ymmh6"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_ymmh6) - 684usize];
    ["Offset of field: __darwin_i386_avx_state::__fpu_ymmh7"]
        [::std::mem::offset_of!(__darwin_i386_avx_state, __fpu_ymmh7) - 700usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_i386_avx512_state {
    pub __fpu_reserved: [::std::os::raw::c_int; 2usize],
    pub __fpu_fcw: __darwin_fp_control,
    pub __fpu_fsw: __darwin_fp_status,
    pub __fpu_ftw: __uint8_t,
    pub __fpu_rsrv1: __uint8_t,
    pub __fpu_fop: __uint16_t,
    pub __fpu_ip: __uint32_t,
    pub __fpu_cs: __uint16_t,
    pub __fpu_rsrv2: __uint16_t,
    pub __fpu_dp: __uint32_t,
    pub __fpu_ds: __uint16_t,
    pub __fpu_rsrv3: __uint16_t,
    pub __fpu_mxcsr: __uint32_t,
    pub __fpu_mxcsrmask: __uint32_t,
    pub __fpu_stmm0: __darwin_mmst_reg,
    pub __fpu_stmm1: __darwin_mmst_reg,
    pub __fpu_stmm2: __darwin_mmst_reg,
    pub __fpu_stmm3: __darwin_mmst_reg,
    pub __fpu_stmm4: __darwin_mmst_reg,
    pub __fpu_stmm5: __darwin_mmst_reg,
    pub __fpu_stmm6: __darwin_mmst_reg,
    pub __fpu_stmm7: __darwin_mmst_reg,
    pub __fpu_xmm0: __darwin_xmm_reg,
    pub __fpu_xmm1: __darwin_xmm_reg,
    pub __fpu_xmm2: __darwin_xmm_reg,
    pub __fpu_xmm3: __darwin_xmm_reg,
    pub __fpu_xmm4: __darwin_xmm_reg,
    pub __fpu_xmm5: __darwin_xmm_reg,
    pub __fpu_xmm6: __darwin_xmm_reg,
    pub __fpu_xmm7: __darwin_xmm_reg,
    pub __fpu_rsrv4: [::std::os::raw::c_char; 224usize],
    pub __fpu_reserved1: ::std::os::raw::c_int,
    pub __avx_reserved1: [::std::os::raw::c_char; 64usize],
    pub __fpu_ymmh0: __darwin_xmm_reg,
    pub __fpu_ymmh1: __darwin_xmm_reg,
    pub __fpu_ymmh2: __darwin_xmm_reg,
    pub __fpu_ymmh3: __darwin_xmm_reg,
    pub __fpu_ymmh4: __darwin_xmm_reg,
    pub __fpu_ymmh5: __darwin_xmm_reg,
    pub __fpu_ymmh6: __darwin_xmm_reg,
    pub __fpu_ymmh7: __darwin_xmm_reg,
    pub __fpu_k0: __darwin_opmask_reg,
    pub __fpu_k1: __darwin_opmask_reg,
    pub __fpu_k2: __darwin_opmask_reg,
    pub __fpu_k3: __darwin_opmask_reg,
    pub __fpu_k4: __darwin_opmask_reg,
    pub __fpu_k5: __darwin_opmask_reg,
    pub __fpu_k6: __darwin_opmask_reg,
    pub __fpu_k7: __darwin_opmask_reg,
    pub __fpu_zmmh0: __darwin_ymm_reg,
    pub __fpu_zmmh1: __darwin_ymm_reg,
    pub __fpu_zmmh2: __darwin_ymm_reg,
    pub __fpu_zmmh3: __darwin_ymm_reg,
    pub __fpu_zmmh4: __darwin_ymm_reg,
    pub __fpu_zmmh5: __darwin_ymm_reg,
    pub __fpu_zmmh6: __darwin_ymm_reg,
    pub __fpu_zmmh7: __darwin_ymm_reg,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_i386_avx512_state"]
        [::std::mem::size_of::<__darwin_i386_avx512_state>() - 1036usize];
    ["Alignment of __darwin_i386_avx512_state"]
        [::std::mem::align_of::<__darwin_i386_avx512_state>() - 4usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_reserved"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_reserved) - 0usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_fcw"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_fcw) - 8usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_fsw"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_fsw) - 10usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_ftw"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_ftw) - 12usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_rsrv1"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_rsrv1) - 13usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_fop"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_fop) - 14usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_ip"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_ip) - 16usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_cs"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_cs) - 20usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_rsrv2"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_rsrv2) - 22usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_dp"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_dp) - 24usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_ds"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_ds) - 28usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_rsrv3"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_rsrv3) - 30usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_mxcsr"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_mxcsr) - 32usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_mxcsrmask"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_mxcsrmask) - 36usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_stmm0"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_stmm0) - 40usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_stmm1"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_stmm1) - 56usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_stmm2"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_stmm2) - 72usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_stmm3"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_stmm3) - 88usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_stmm4"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_stmm4) - 104usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_stmm5"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_stmm5) - 120usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_stmm6"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_stmm6) - 136usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_stmm7"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_stmm7) - 152usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_xmm0"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_xmm0) - 168usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_xmm1"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_xmm1) - 184usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_xmm2"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_xmm2) - 200usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_xmm3"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_xmm3) - 216usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_xmm4"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_xmm4) - 232usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_xmm5"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_xmm5) - 248usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_xmm6"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_xmm6) - 264usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_xmm7"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_xmm7) - 280usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_rsrv4"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_rsrv4) - 296usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_reserved1"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_reserved1) - 520usize];
    ["Offset of field: __darwin_i386_avx512_state::__avx_reserved1"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __avx_reserved1) - 524usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_ymmh0"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_ymmh0) - 588usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_ymmh1"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_ymmh1) - 604usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_ymmh2"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_ymmh2) - 620usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_ymmh3"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_ymmh3) - 636usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_ymmh4"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_ymmh4) - 652usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_ymmh5"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_ymmh5) - 668usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_ymmh6"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_ymmh6) - 684usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_ymmh7"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_ymmh7) - 700usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_k0"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_k0) - 716usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_k1"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_k1) - 724usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_k2"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_k2) - 732usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_k3"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_k3) - 740usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_k4"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_k4) - 748usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_k5"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_k5) - 756usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_k6"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_k6) - 764usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_k7"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_k7) - 772usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_zmmh0"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_zmmh0) - 780usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_zmmh1"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_zmmh1) - 812usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_zmmh2"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_zmmh2) - 844usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_zmmh3"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_zmmh3) - 876usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_zmmh4"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_zmmh4) - 908usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_zmmh5"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_zmmh5) - 940usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_zmmh6"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_zmmh6) - 972usize];
    ["Offset of field: __darwin_i386_avx512_state::__fpu_zmmh7"]
        [::std::mem::offset_of!(__darwin_i386_avx512_state, __fpu_zmmh7) - 1004usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_i386_exception_state {
    pub __trapno: __uint16_t,
    pub __cpu: __uint16_t,
    pub __err: __uint32_t,
    pub __faultvaddr: __uint32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_i386_exception_state"]
        [::std::mem::size_of::<__darwin_i386_exception_state>() - 12usize];
    ["Alignment of __darwin_i386_exception_state"]
        [::std::mem::align_of::<__darwin_i386_exception_state>() - 4usize];
    ["Offset of field: __darwin_i386_exception_state::__trapno"]
        [::std::mem::offset_of!(__darwin_i386_exception_state, __trapno) - 0usize];
    ["Offset of field: __darwin_i386_exception_state::__cpu"]
        [::std::mem::offset_of!(__darwin_i386_exception_state, __cpu) - 2usize];
    ["Offset of field: __darwin_i386_exception_state::__err"]
        [::std::mem::offset_of!(__darwin_i386_exception_state, __err) - 4usize];
    ["Offset of field: __darwin_i386_exception_state::__faultvaddr"]
        [::std::mem::offset_of!(__darwin_i386_exception_state, __faultvaddr) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_x86_debug_state32 {
    pub __dr0: ::std::os::raw::c_uint,
    pub __dr1: ::std::os::raw::c_uint,
    pub __dr2: ::std::os::raw::c_uint,
    pub __dr3: ::std::os::raw::c_uint,
    pub __dr4: ::std::os::raw::c_uint,
    pub __dr5: ::std::os::raw::c_uint,
    pub __dr6: ::std::os::raw::c_uint,
    pub __dr7: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_x86_debug_state32"]
        [::std::mem::size_of::<__darwin_x86_debug_state32>() - 32usize];
    ["Alignment of __darwin_x86_debug_state32"]
        [::std::mem::align_of::<__darwin_x86_debug_state32>() - 4usize];
    ["Offset of field: __darwin_x86_debug_state32::__dr0"]
        [::std::mem::offset_of!(__darwin_x86_debug_state32, __dr0) - 0usize];
    ["Offset of field: __darwin_x86_debug_state32::__dr1"]
        [::std::mem::offset_of!(__darwin_x86_debug_state32, __dr1) - 4usize];
    ["Offset of field: __darwin_x86_debug_state32::__dr2"]
        [::std::mem::offset_of!(__darwin_x86_debug_state32, __dr2) - 8usize];
    ["Offset of field: __darwin_x86_debug_state32::__dr3"]
        [::std::mem::offset_of!(__darwin_x86_debug_state32, __dr3) - 12usize];
    ["Offset of field: __darwin_x86_debug_state32::__dr4"]
        [::std::mem::offset_of!(__darwin_x86_debug_state32, __dr4) - 16usize];
    ["Offset of field: __darwin_x86_debug_state32::__dr5"]
        [::std::mem::offset_of!(__darwin_x86_debug_state32, __dr5) - 20usize];
    ["Offset of field: __darwin_x86_debug_state32::__dr6"]
        [::std::mem::offset_of!(__darwin_x86_debug_state32, __dr6) - 24usize];
    ["Offset of field: __darwin_x86_debug_state32::__dr7"]
        [::std::mem::offset_of!(__darwin_x86_debug_state32, __dr7) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __x86_instruction_state {
    pub __insn_stream_valid_bytes: ::std::os::raw::c_int,
    pub __insn_offset: ::std::os::raw::c_int,
    pub __out_of_synch: ::std::os::raw::c_int,
    pub __insn_bytes: [__uint8_t; 2380usize],
    pub __insn_cacheline: [__uint8_t; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __x86_instruction_state"]
        [::std::mem::size_of::<__x86_instruction_state>() - 2456usize];
    ["Alignment of __x86_instruction_state"]
        [::std::mem::align_of::<__x86_instruction_state>() - 4usize];
    ["Offset of field: __x86_instruction_state::__insn_stream_valid_bytes"]
        [::std::mem::offset_of!(__x86_instruction_state, __insn_stream_valid_bytes) - 0usize];
    ["Offset of field: __x86_instruction_state::__insn_offset"]
        [::std::mem::offset_of!(__x86_instruction_state, __insn_offset) - 4usize];
    ["Offset of field: __x86_instruction_state::__out_of_synch"]
        [::std::mem::offset_of!(__x86_instruction_state, __out_of_synch) - 8usize];
    ["Offset of field: __x86_instruction_state::__insn_bytes"]
        [::std::mem::offset_of!(__x86_instruction_state, __insn_bytes) - 12usize];
    ["Offset of field: __x86_instruction_state::__insn_cacheline"]
        [::std::mem::offset_of!(__x86_instruction_state, __insn_cacheline) - 2392usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __last_branch_record {
    pub __from_ip: __uint64_t,
    pub __to_ip: __uint64_t,
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub __bindgen_padding_0: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __last_branch_record"][::std::mem::size_of::<__last_branch_record>() - 24usize];
    ["Alignment of __last_branch_record"][::std::mem::align_of::<__last_branch_record>() - 8usize];
    ["Offset of field: __last_branch_record::__from_ip"]
        [::std::mem::offset_of!(__last_branch_record, __from_ip) - 0usize];
    ["Offset of field: __last_branch_record::__to_ip"]
        [::std::mem::offset_of!(__last_branch_record, __to_ip) - 8usize];
};
impl __last_branch_record {
    #[inline]
    pub fn __mispredict(&self) -> __uint32_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set___mispredict(&mut self, val: __uint32_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __mispredict_raw(this: *const Self) -> __uint32_t {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set___mispredict_raw(this: *mut Self, val: __uint32_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __tsx_abort(&self) -> __uint32_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set___tsx_abort(&mut self, val: __uint32_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __tsx_abort_raw(this: *const Self) -> __uint32_t {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set___tsx_abort_raw(this: *mut Self, val: __uint32_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __in_tsx(&self) -> __uint32_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set___in_tsx(&mut self, val: __uint32_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __in_tsx_raw(this: *const Self) -> __uint32_t {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set___in_tsx_raw(this: *mut Self, val: __uint32_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __cycle_count(&self) -> __uint32_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set___cycle_count(&mut self, val: __uint32_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __cycle_count_raw(this: *const Self) -> __uint32_t {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                16u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set___cycle_count_raw(this: *mut Self, val: __uint32_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                16u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __reserved(&self) -> __uint32_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(19usize, 13u8) as u32) }
    }
    #[inline]
    pub fn set___reserved(&mut self, val: __uint32_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(19usize, 13u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __reserved_raw(this: *const Self) -> __uint32_t {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                19usize,
                13u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set___reserved_raw(this: *mut Self, val: __uint32_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                19usize,
                13u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        __mispredict: __uint32_t,
        __tsx_abort: __uint32_t,
        __in_tsx: __uint32_t,
        __cycle_count: __uint32_t,
        __reserved: __uint32_t,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let __mispredict: u32 = unsafe { ::std::mem::transmute(__mispredict) };
            __mispredict as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let __tsx_abort: u32 = unsafe { ::std::mem::transmute(__tsx_abort) };
            __tsx_abort as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let __in_tsx: u32 = unsafe { ::std::mem::transmute(__in_tsx) };
            __in_tsx as u64
        });
        __bindgen_bitfield_unit.set(3usize, 16u8, {
            let __cycle_count: u32 = unsafe { ::std::mem::transmute(__cycle_count) };
            __cycle_count as u64
        });
        __bindgen_bitfield_unit.set(19usize, 13u8, {
            let __reserved: u32 = unsafe { ::std::mem::transmute(__reserved) };
            __reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __last_branch_state {
    pub __lbr_count: ::std::os::raw::c_int,
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub __lbrs: [__last_branch_record; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __last_branch_state"][::std::mem::size_of::<__last_branch_state>() - 776usize];
    ["Alignment of __last_branch_state"][::std::mem::align_of::<__last_branch_state>() - 8usize];
    ["Offset of field: __last_branch_state::__lbr_count"]
        [::std::mem::offset_of!(__last_branch_state, __lbr_count) - 0usize];
    ["Offset of field: __last_branch_state::__lbrs"]
        [::std::mem::offset_of!(__last_branch_state, __lbrs) - 8usize];
};
impl __last_branch_state {
    #[inline]
    pub fn __lbr_supported_tsx(&self) -> __uint32_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set___lbr_supported_tsx(&mut self, val: __uint32_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __lbr_supported_tsx_raw(this: *const Self) -> __uint32_t {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set___lbr_supported_tsx_raw(this: *mut Self, val: __uint32_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __lbr_supported_cycle_count(&self) -> __uint32_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set___lbr_supported_cycle_count(&mut self, val: __uint32_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __lbr_supported_cycle_count_raw(this: *const Self) -> __uint32_t {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set___lbr_supported_cycle_count_raw(this: *mut Self, val: __uint32_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn __reserved(&self) -> __uint32_t {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 30u8) as u32) }
    }
    #[inline]
    pub fn set___reserved(&mut self, val: __uint32_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 30u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn __reserved_raw(this: *const Self) -> __uint32_t {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                30u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set___reserved_raw(this: *mut Self, val: __uint32_t) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                30u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        __lbr_supported_tsx: __uint32_t,
        __lbr_supported_cycle_count: __uint32_t,
        __reserved: __uint32_t,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let __lbr_supported_tsx: u32 = unsafe { ::std::mem::transmute(__lbr_supported_tsx) };
            __lbr_supported_tsx as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let __lbr_supported_cycle_count: u32 =
                unsafe { ::std::mem::transmute(__lbr_supported_cycle_count) };
            __lbr_supported_cycle_count as u64
        });
        __bindgen_bitfield_unit.set(2usize, 30u8, {
            let __reserved: u32 = unsafe { ::std::mem::transmute(__reserved) };
            __reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __x86_pagein_state {
    pub __pagein_error: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __x86_pagein_state"][::std::mem::size_of::<__x86_pagein_state>() - 4usize];
    ["Alignment of __x86_pagein_state"][::std::mem::align_of::<__x86_pagein_state>() - 4usize];
    ["Offset of field: __x86_pagein_state::__pagein_error"]
        [::std::mem::offset_of!(__x86_pagein_state, __pagein_error) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_x86_thread_state64 {
    pub __rax: __uint64_t,
    pub __rbx: __uint64_t,
    pub __rcx: __uint64_t,
    pub __rdx: __uint64_t,
    pub __rdi: __uint64_t,
    pub __rsi: __uint64_t,
    pub __rbp: __uint64_t,
    pub __rsp: __uint64_t,
    pub __r8: __uint64_t,
    pub __r9: __uint64_t,
    pub __r10: __uint64_t,
    pub __r11: __uint64_t,
    pub __r12: __uint64_t,
    pub __r13: __uint64_t,
    pub __r14: __uint64_t,
    pub __r15: __uint64_t,
    pub __rip: __uint64_t,
    pub __rflags: __uint64_t,
    pub __cs: __uint64_t,
    pub __fs: __uint64_t,
    pub __gs: __uint64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_x86_thread_state64"]
        [::std::mem::size_of::<__darwin_x86_thread_state64>() - 168usize];
    ["Alignment of __darwin_x86_thread_state64"]
        [::std::mem::align_of::<__darwin_x86_thread_state64>() - 8usize];
    ["Offset of field: __darwin_x86_thread_state64::__rax"]
        [::std::mem::offset_of!(__darwin_x86_thread_state64, __rax) - 0usize];
    ["Offset of field: __darwin_x86_thread_state64::__rbx"]
        [::std::mem::offset_of!(__darwin_x86_thread_state64, __rbx) - 8usize];
    ["Offset of field: __darwin_x86_thread_state64::__rcx"]
        [::std::mem::offset_of!(__darwin_x86_thread_state64, __rcx) - 16usize];
    ["Offset of field: __darwin_x86_thread_state64::__rdx"]
        [::std::mem::offset_of!(__darwin_x86_thread_state64, __rdx) - 24usize];
    ["Offset of field: __darwin_x86_thread_state64::__rdi"]
        [::std::mem::offset_of!(__darwin_x86_thread_state64, __rdi) - 32usize];
    ["Offset of field: __darwin_x86_thread_state64::__rsi"]
        [::std::mem::offset_of!(__darwin_x86_thread_state64, __rsi) - 40usize];
    ["Offset of field: __darwin_x86_thread_state64::__rbp"]
        [::std::mem::offset_of!(__darwin_x86_thread_state64, __rbp) - 48usize];
    ["Offset of field: __darwin_x86_thread_state64::__rsp"]
        [::std::mem::offset_of!(__darwin_x86_thread_state64, __rsp) - 56usize];
    ["Offset of field: __darwin_x86_thread_state64::__r8"]
        [::std::mem::offset_of!(__darwin_x86_thread_state64, __r8) - 64usize];
    ["Offset of field: __darwin_x86_thread_state64::__r9"]
        [::std::mem::offset_of!(__darwin_x86_thread_state64, __r9) - 72usize];
    ["Offset of field: __darwin_x86_thread_state64::__r10"]
        [::std::mem::offset_of!(__darwin_x86_thread_state64, __r10) - 80usize];
    ["Offset of field: __darwin_x86_thread_state64::__r11"]
        [::std::mem::offset_of!(__darwin_x86_thread_state64, __r11) - 88usize];
    ["Offset of field: __darwin_x86_thread_state64::__r12"]
        [::std::mem::offset_of!(__darwin_x86_thread_state64, __r12) - 96usize];
    ["Offset of field: __darwin_x86_thread_state64::__r13"]
        [::std::mem::offset_of!(__darwin_x86_thread_state64, __r13) - 104usize];
    ["Offset of field: __darwin_x86_thread_state64::__r14"]
        [::std::mem::offset_of!(__darwin_x86_thread_state64, __r14) - 112usize];
    ["Offset of field: __darwin_x86_thread_state64::__r15"]
        [::std::mem::offset_of!(__darwin_x86_thread_state64, __r15) - 120usize];
    ["Offset of field: __darwin_x86_thread_state64::__rip"]
        [::std::mem::offset_of!(__darwin_x86_thread_state64, __rip) - 128usize];
    ["Offset of field: __darwin_x86_thread_state64::__rflags"]
        [::std::mem::offset_of!(__darwin_x86_thread_state64, __rflags) - 136usize];
    ["Offset of field: __darwin_x86_thread_state64::__cs"]
        [::std::mem::offset_of!(__darwin_x86_thread_state64, __cs) - 144usize];
    ["Offset of field: __darwin_x86_thread_state64::__fs"]
        [::std::mem::offset_of!(__darwin_x86_thread_state64, __fs) - 152usize];
    ["Offset of field: __darwin_x86_thread_state64::__gs"]
        [::std::mem::offset_of!(__darwin_x86_thread_state64, __gs) - 160usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_x86_thread_full_state64 {
    pub __ss64: __darwin_x86_thread_state64,
    pub __ds: __uint64_t,
    pub __es: __uint64_t,
    pub __ss: __uint64_t,
    pub __gsbase: __uint64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_x86_thread_full_state64"]
        [::std::mem::size_of::<__darwin_x86_thread_full_state64>() - 200usize];
    ["Alignment of __darwin_x86_thread_full_state64"]
        [::std::mem::align_of::<__darwin_x86_thread_full_state64>() - 8usize];
    ["Offset of field: __darwin_x86_thread_full_state64::__ss64"]
        [::std::mem::offset_of!(__darwin_x86_thread_full_state64, __ss64) - 0usize];
    ["Offset of field: __darwin_x86_thread_full_state64::__ds"]
        [::std::mem::offset_of!(__darwin_x86_thread_full_state64, __ds) - 168usize];
    ["Offset of field: __darwin_x86_thread_full_state64::__es"]
        [::std::mem::offset_of!(__darwin_x86_thread_full_state64, __es) - 176usize];
    ["Offset of field: __darwin_x86_thread_full_state64::__ss"]
        [::std::mem::offset_of!(__darwin_x86_thread_full_state64, __ss) - 184usize];
    ["Offset of field: __darwin_x86_thread_full_state64::__gsbase"]
        [::std::mem::offset_of!(__darwin_x86_thread_full_state64, __gsbase) - 192usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_x86_float_state64 {
    pub __fpu_reserved: [::std::os::raw::c_int; 2usize],
    pub __fpu_fcw: __darwin_fp_control,
    pub __fpu_fsw: __darwin_fp_status,
    pub __fpu_ftw: __uint8_t,
    pub __fpu_rsrv1: __uint8_t,
    pub __fpu_fop: __uint16_t,
    pub __fpu_ip: __uint32_t,
    pub __fpu_cs: __uint16_t,
    pub __fpu_rsrv2: __uint16_t,
    pub __fpu_dp: __uint32_t,
    pub __fpu_ds: __uint16_t,
    pub __fpu_rsrv3: __uint16_t,
    pub __fpu_mxcsr: __uint32_t,
    pub __fpu_mxcsrmask: __uint32_t,
    pub __fpu_stmm0: __darwin_mmst_reg,
    pub __fpu_stmm1: __darwin_mmst_reg,
    pub __fpu_stmm2: __darwin_mmst_reg,
    pub __fpu_stmm3: __darwin_mmst_reg,
    pub __fpu_stmm4: __darwin_mmst_reg,
    pub __fpu_stmm5: __darwin_mmst_reg,
    pub __fpu_stmm6: __darwin_mmst_reg,
    pub __fpu_stmm7: __darwin_mmst_reg,
    pub __fpu_xmm0: __darwin_xmm_reg,
    pub __fpu_xmm1: __darwin_xmm_reg,
    pub __fpu_xmm2: __darwin_xmm_reg,
    pub __fpu_xmm3: __darwin_xmm_reg,
    pub __fpu_xmm4: __darwin_xmm_reg,
    pub __fpu_xmm5: __darwin_xmm_reg,
    pub __fpu_xmm6: __darwin_xmm_reg,
    pub __fpu_xmm7: __darwin_xmm_reg,
    pub __fpu_xmm8: __darwin_xmm_reg,
    pub __fpu_xmm9: __darwin_xmm_reg,
    pub __fpu_xmm10: __darwin_xmm_reg,
    pub __fpu_xmm11: __darwin_xmm_reg,
    pub __fpu_xmm12: __darwin_xmm_reg,
    pub __fpu_xmm13: __darwin_xmm_reg,
    pub __fpu_xmm14: __darwin_xmm_reg,
    pub __fpu_xmm15: __darwin_xmm_reg,
    pub __fpu_rsrv4: [::std::os::raw::c_char; 96usize],
    pub __fpu_reserved1: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_x86_float_state64"]
        [::std::mem::size_of::<__darwin_x86_float_state64>() - 524usize];
    ["Alignment of __darwin_x86_float_state64"]
        [::std::mem::align_of::<__darwin_x86_float_state64>() - 4usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_reserved"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_reserved) - 0usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_fcw"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_fcw) - 8usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_fsw"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_fsw) - 10usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_ftw"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_ftw) - 12usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_rsrv1"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_rsrv1) - 13usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_fop"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_fop) - 14usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_ip"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_ip) - 16usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_cs"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_cs) - 20usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_rsrv2"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_rsrv2) - 22usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_dp"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_dp) - 24usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_ds"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_ds) - 28usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_rsrv3"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_rsrv3) - 30usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_mxcsr"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_mxcsr) - 32usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_mxcsrmask"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_mxcsrmask) - 36usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_stmm0"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_stmm0) - 40usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_stmm1"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_stmm1) - 56usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_stmm2"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_stmm2) - 72usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_stmm3"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_stmm3) - 88usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_stmm4"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_stmm4) - 104usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_stmm5"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_stmm5) - 120usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_stmm6"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_stmm6) - 136usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_stmm7"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_stmm7) - 152usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_xmm0"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_xmm0) - 168usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_xmm1"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_xmm1) - 184usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_xmm2"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_xmm2) - 200usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_xmm3"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_xmm3) - 216usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_xmm4"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_xmm4) - 232usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_xmm5"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_xmm5) - 248usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_xmm6"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_xmm6) - 264usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_xmm7"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_xmm7) - 280usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_xmm8"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_xmm8) - 296usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_xmm9"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_xmm9) - 312usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_xmm10"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_xmm10) - 328usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_xmm11"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_xmm11) - 344usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_xmm12"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_xmm12) - 360usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_xmm13"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_xmm13) - 376usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_xmm14"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_xmm14) - 392usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_xmm15"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_xmm15) - 408usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_rsrv4"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_rsrv4) - 424usize];
    ["Offset of field: __darwin_x86_float_state64::__fpu_reserved1"]
        [::std::mem::offset_of!(__darwin_x86_float_state64, __fpu_reserved1) - 520usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_x86_avx_state64 {
    pub __fpu_reserved: [::std::os::raw::c_int; 2usize],
    pub __fpu_fcw: __darwin_fp_control,
    pub __fpu_fsw: __darwin_fp_status,
    pub __fpu_ftw: __uint8_t,
    pub __fpu_rsrv1: __uint8_t,
    pub __fpu_fop: __uint16_t,
    pub __fpu_ip: __uint32_t,
    pub __fpu_cs: __uint16_t,
    pub __fpu_rsrv2: __uint16_t,
    pub __fpu_dp: __uint32_t,
    pub __fpu_ds: __uint16_t,
    pub __fpu_rsrv3: __uint16_t,
    pub __fpu_mxcsr: __uint32_t,
    pub __fpu_mxcsrmask: __uint32_t,
    pub __fpu_stmm0: __darwin_mmst_reg,
    pub __fpu_stmm1: __darwin_mmst_reg,
    pub __fpu_stmm2: __darwin_mmst_reg,
    pub __fpu_stmm3: __darwin_mmst_reg,
    pub __fpu_stmm4: __darwin_mmst_reg,
    pub __fpu_stmm5: __darwin_mmst_reg,
    pub __fpu_stmm6: __darwin_mmst_reg,
    pub __fpu_stmm7: __darwin_mmst_reg,
    pub __fpu_xmm0: __darwin_xmm_reg,
    pub __fpu_xmm1: __darwin_xmm_reg,
    pub __fpu_xmm2: __darwin_xmm_reg,
    pub __fpu_xmm3: __darwin_xmm_reg,
    pub __fpu_xmm4: __darwin_xmm_reg,
    pub __fpu_xmm5: __darwin_xmm_reg,
    pub __fpu_xmm6: __darwin_xmm_reg,
    pub __fpu_xmm7: __darwin_xmm_reg,
    pub __fpu_xmm8: __darwin_xmm_reg,
    pub __fpu_xmm9: __darwin_xmm_reg,
    pub __fpu_xmm10: __darwin_xmm_reg,
    pub __fpu_xmm11: __darwin_xmm_reg,
    pub __fpu_xmm12: __darwin_xmm_reg,
    pub __fpu_xmm13: __darwin_xmm_reg,
    pub __fpu_xmm14: __darwin_xmm_reg,
    pub __fpu_xmm15: __darwin_xmm_reg,
    pub __fpu_rsrv4: [::std::os::raw::c_char; 96usize],
    pub __fpu_reserved1: ::std::os::raw::c_int,
    pub __avx_reserved1: [::std::os::raw::c_char; 64usize],
    pub __fpu_ymmh0: __darwin_xmm_reg,
    pub __fpu_ymmh1: __darwin_xmm_reg,
    pub __fpu_ymmh2: __darwin_xmm_reg,
    pub __fpu_ymmh3: __darwin_xmm_reg,
    pub __fpu_ymmh4: __darwin_xmm_reg,
    pub __fpu_ymmh5: __darwin_xmm_reg,
    pub __fpu_ymmh6: __darwin_xmm_reg,
    pub __fpu_ymmh7: __darwin_xmm_reg,
    pub __fpu_ymmh8: __darwin_xmm_reg,
    pub __fpu_ymmh9: __darwin_xmm_reg,
    pub __fpu_ymmh10: __darwin_xmm_reg,
    pub __fpu_ymmh11: __darwin_xmm_reg,
    pub __fpu_ymmh12: __darwin_xmm_reg,
    pub __fpu_ymmh13: __darwin_xmm_reg,
    pub __fpu_ymmh14: __darwin_xmm_reg,
    pub __fpu_ymmh15: __darwin_xmm_reg,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_x86_avx_state64"]
        [::std::mem::size_of::<__darwin_x86_avx_state64>() - 844usize];
    ["Alignment of __darwin_x86_avx_state64"]
        [::std::mem::align_of::<__darwin_x86_avx_state64>() - 4usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_reserved"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_reserved) - 0usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_fcw"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_fcw) - 8usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_fsw"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_fsw) - 10usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_ftw"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_ftw) - 12usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_rsrv1"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_rsrv1) - 13usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_fop"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_fop) - 14usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_ip"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_ip) - 16usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_cs"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_cs) - 20usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_rsrv2"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_rsrv2) - 22usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_dp"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_dp) - 24usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_ds"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_ds) - 28usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_rsrv3"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_rsrv3) - 30usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_mxcsr"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_mxcsr) - 32usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_mxcsrmask"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_mxcsrmask) - 36usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_stmm0"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_stmm0) - 40usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_stmm1"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_stmm1) - 56usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_stmm2"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_stmm2) - 72usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_stmm3"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_stmm3) - 88usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_stmm4"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_stmm4) - 104usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_stmm5"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_stmm5) - 120usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_stmm6"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_stmm6) - 136usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_stmm7"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_stmm7) - 152usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_xmm0"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_xmm0) - 168usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_xmm1"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_xmm1) - 184usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_xmm2"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_xmm2) - 200usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_xmm3"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_xmm3) - 216usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_xmm4"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_xmm4) - 232usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_xmm5"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_xmm5) - 248usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_xmm6"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_xmm6) - 264usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_xmm7"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_xmm7) - 280usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_xmm8"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_xmm8) - 296usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_xmm9"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_xmm9) - 312usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_xmm10"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_xmm10) - 328usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_xmm11"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_xmm11) - 344usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_xmm12"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_xmm12) - 360usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_xmm13"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_xmm13) - 376usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_xmm14"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_xmm14) - 392usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_xmm15"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_xmm15) - 408usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_rsrv4"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_rsrv4) - 424usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_reserved1"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_reserved1) - 520usize];
    ["Offset of field: __darwin_x86_avx_state64::__avx_reserved1"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __avx_reserved1) - 524usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_ymmh0"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_ymmh0) - 588usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_ymmh1"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_ymmh1) - 604usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_ymmh2"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_ymmh2) - 620usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_ymmh3"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_ymmh3) - 636usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_ymmh4"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_ymmh4) - 652usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_ymmh5"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_ymmh5) - 668usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_ymmh6"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_ymmh6) - 684usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_ymmh7"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_ymmh7) - 700usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_ymmh8"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_ymmh8) - 716usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_ymmh9"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_ymmh9) - 732usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_ymmh10"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_ymmh10) - 748usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_ymmh11"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_ymmh11) - 764usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_ymmh12"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_ymmh12) - 780usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_ymmh13"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_ymmh13) - 796usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_ymmh14"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_ymmh14) - 812usize];
    ["Offset of field: __darwin_x86_avx_state64::__fpu_ymmh15"]
        [::std::mem::offset_of!(__darwin_x86_avx_state64, __fpu_ymmh15) - 828usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_x86_avx512_state64 {
    pub __fpu_reserved: [::std::os::raw::c_int; 2usize],
    pub __fpu_fcw: __darwin_fp_control,
    pub __fpu_fsw: __darwin_fp_status,
    pub __fpu_ftw: __uint8_t,
    pub __fpu_rsrv1: __uint8_t,
    pub __fpu_fop: __uint16_t,
    pub __fpu_ip: __uint32_t,
    pub __fpu_cs: __uint16_t,
    pub __fpu_rsrv2: __uint16_t,
    pub __fpu_dp: __uint32_t,
    pub __fpu_ds: __uint16_t,
    pub __fpu_rsrv3: __uint16_t,
    pub __fpu_mxcsr: __uint32_t,
    pub __fpu_mxcsrmask: __uint32_t,
    pub __fpu_stmm0: __darwin_mmst_reg,
    pub __fpu_stmm1: __darwin_mmst_reg,
    pub __fpu_stmm2: __darwin_mmst_reg,
    pub __fpu_stmm3: __darwin_mmst_reg,
    pub __fpu_stmm4: __darwin_mmst_reg,
    pub __fpu_stmm5: __darwin_mmst_reg,
    pub __fpu_stmm6: __darwin_mmst_reg,
    pub __fpu_stmm7: __darwin_mmst_reg,
    pub __fpu_xmm0: __darwin_xmm_reg,
    pub __fpu_xmm1: __darwin_xmm_reg,
    pub __fpu_xmm2: __darwin_xmm_reg,
    pub __fpu_xmm3: __darwin_xmm_reg,
    pub __fpu_xmm4: __darwin_xmm_reg,
    pub __fpu_xmm5: __darwin_xmm_reg,
    pub __fpu_xmm6: __darwin_xmm_reg,
    pub __fpu_xmm7: __darwin_xmm_reg,
    pub __fpu_xmm8: __darwin_xmm_reg,
    pub __fpu_xmm9: __darwin_xmm_reg,
    pub __fpu_xmm10: __darwin_xmm_reg,
    pub __fpu_xmm11: __darwin_xmm_reg,
    pub __fpu_xmm12: __darwin_xmm_reg,
    pub __fpu_xmm13: __darwin_xmm_reg,
    pub __fpu_xmm14: __darwin_xmm_reg,
    pub __fpu_xmm15: __darwin_xmm_reg,
    pub __fpu_rsrv4: [::std::os::raw::c_char; 96usize],
    pub __fpu_reserved1: ::std::os::raw::c_int,
    pub __avx_reserved1: [::std::os::raw::c_char; 64usize],
    pub __fpu_ymmh0: __darwin_xmm_reg,
    pub __fpu_ymmh1: __darwin_xmm_reg,
    pub __fpu_ymmh2: __darwin_xmm_reg,
    pub __fpu_ymmh3: __darwin_xmm_reg,
    pub __fpu_ymmh4: __darwin_xmm_reg,
    pub __fpu_ymmh5: __darwin_xmm_reg,
    pub __fpu_ymmh6: __darwin_xmm_reg,
    pub __fpu_ymmh7: __darwin_xmm_reg,
    pub __fpu_ymmh8: __darwin_xmm_reg,
    pub __fpu_ymmh9: __darwin_xmm_reg,
    pub __fpu_ymmh10: __darwin_xmm_reg,
    pub __fpu_ymmh11: __darwin_xmm_reg,
    pub __fpu_ymmh12: __darwin_xmm_reg,
    pub __fpu_ymmh13: __darwin_xmm_reg,
    pub __fpu_ymmh14: __darwin_xmm_reg,
    pub __fpu_ymmh15: __darwin_xmm_reg,
    pub __fpu_k0: __darwin_opmask_reg,
    pub __fpu_k1: __darwin_opmask_reg,
    pub __fpu_k2: __darwin_opmask_reg,
    pub __fpu_k3: __darwin_opmask_reg,
    pub __fpu_k4: __darwin_opmask_reg,
    pub __fpu_k5: __darwin_opmask_reg,
    pub __fpu_k6: __darwin_opmask_reg,
    pub __fpu_k7: __darwin_opmask_reg,
    pub __fpu_zmmh0: __darwin_ymm_reg,
    pub __fpu_zmmh1: __darwin_ymm_reg,
    pub __fpu_zmmh2: __darwin_ymm_reg,
    pub __fpu_zmmh3: __darwin_ymm_reg,
    pub __fpu_zmmh4: __darwin_ymm_reg,
    pub __fpu_zmmh5: __darwin_ymm_reg,
    pub __fpu_zmmh6: __darwin_ymm_reg,
    pub __fpu_zmmh7: __darwin_ymm_reg,
    pub __fpu_zmmh8: __darwin_ymm_reg,
    pub __fpu_zmmh9: __darwin_ymm_reg,
    pub __fpu_zmmh10: __darwin_ymm_reg,
    pub __fpu_zmmh11: __darwin_ymm_reg,
    pub __fpu_zmmh12: __darwin_ymm_reg,
    pub __fpu_zmmh13: __darwin_ymm_reg,
    pub __fpu_zmmh14: __darwin_ymm_reg,
    pub __fpu_zmmh15: __darwin_ymm_reg,
    pub __fpu_zmm16: __darwin_zmm_reg,
    pub __fpu_zmm17: __darwin_zmm_reg,
    pub __fpu_zmm18: __darwin_zmm_reg,
    pub __fpu_zmm19: __darwin_zmm_reg,
    pub __fpu_zmm20: __darwin_zmm_reg,
    pub __fpu_zmm21: __darwin_zmm_reg,
    pub __fpu_zmm22: __darwin_zmm_reg,
    pub __fpu_zmm23: __darwin_zmm_reg,
    pub __fpu_zmm24: __darwin_zmm_reg,
    pub __fpu_zmm25: __darwin_zmm_reg,
    pub __fpu_zmm26: __darwin_zmm_reg,
    pub __fpu_zmm27: __darwin_zmm_reg,
    pub __fpu_zmm28: __darwin_zmm_reg,
    pub __fpu_zmm29: __darwin_zmm_reg,
    pub __fpu_zmm30: __darwin_zmm_reg,
    pub __fpu_zmm31: __darwin_zmm_reg,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_x86_avx512_state64"]
        [::std::mem::size_of::<__darwin_x86_avx512_state64>() - 2444usize];
    ["Alignment of __darwin_x86_avx512_state64"]
        [::std::mem::align_of::<__darwin_x86_avx512_state64>() - 4usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_reserved"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_reserved) - 0usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_fcw"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_fcw) - 8usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_fsw"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_fsw) - 10usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_ftw"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_ftw) - 12usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_rsrv1"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_rsrv1) - 13usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_fop"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_fop) - 14usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_ip"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_ip) - 16usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_cs"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_cs) - 20usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_rsrv2"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_rsrv2) - 22usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_dp"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_dp) - 24usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_ds"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_ds) - 28usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_rsrv3"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_rsrv3) - 30usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_mxcsr"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_mxcsr) - 32usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_mxcsrmask"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_mxcsrmask) - 36usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_stmm0"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_stmm0) - 40usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_stmm1"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_stmm1) - 56usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_stmm2"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_stmm2) - 72usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_stmm3"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_stmm3) - 88usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_stmm4"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_stmm4) - 104usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_stmm5"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_stmm5) - 120usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_stmm6"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_stmm6) - 136usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_stmm7"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_stmm7) - 152usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_xmm0"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_xmm0) - 168usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_xmm1"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_xmm1) - 184usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_xmm2"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_xmm2) - 200usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_xmm3"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_xmm3) - 216usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_xmm4"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_xmm4) - 232usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_xmm5"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_xmm5) - 248usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_xmm6"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_xmm6) - 264usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_xmm7"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_xmm7) - 280usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_xmm8"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_xmm8) - 296usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_xmm9"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_xmm9) - 312usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_xmm10"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_xmm10) - 328usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_xmm11"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_xmm11) - 344usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_xmm12"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_xmm12) - 360usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_xmm13"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_xmm13) - 376usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_xmm14"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_xmm14) - 392usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_xmm15"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_xmm15) - 408usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_rsrv4"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_rsrv4) - 424usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_reserved1"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_reserved1) - 520usize];
    ["Offset of field: __darwin_x86_avx512_state64::__avx_reserved1"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __avx_reserved1) - 524usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_ymmh0"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_ymmh0) - 588usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_ymmh1"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_ymmh1) - 604usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_ymmh2"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_ymmh2) - 620usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_ymmh3"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_ymmh3) - 636usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_ymmh4"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_ymmh4) - 652usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_ymmh5"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_ymmh5) - 668usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_ymmh6"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_ymmh6) - 684usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_ymmh7"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_ymmh7) - 700usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_ymmh8"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_ymmh8) - 716usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_ymmh9"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_ymmh9) - 732usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_ymmh10"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_ymmh10) - 748usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_ymmh11"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_ymmh11) - 764usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_ymmh12"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_ymmh12) - 780usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_ymmh13"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_ymmh13) - 796usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_ymmh14"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_ymmh14) - 812usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_ymmh15"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_ymmh15) - 828usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_k0"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_k0) - 844usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_k1"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_k1) - 852usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_k2"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_k2) - 860usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_k3"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_k3) - 868usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_k4"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_k4) - 876usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_k5"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_k5) - 884usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_k6"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_k6) - 892usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_k7"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_k7) - 900usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmmh0"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmmh0) - 908usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmmh1"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmmh1) - 940usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmmh2"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmmh2) - 972usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmmh3"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmmh3) - 1004usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmmh4"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmmh4) - 1036usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmmh5"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmmh5) - 1068usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmmh6"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmmh6) - 1100usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmmh7"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmmh7) - 1132usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmmh8"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmmh8) - 1164usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmmh9"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmmh9) - 1196usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmmh10"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmmh10) - 1228usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmmh11"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmmh11) - 1260usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmmh12"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmmh12) - 1292usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmmh13"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmmh13) - 1324usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmmh14"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmmh14) - 1356usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmmh15"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmmh15) - 1388usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmm16"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmm16) - 1420usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmm17"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmm17) - 1484usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmm18"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmm18) - 1548usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmm19"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmm19) - 1612usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmm20"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmm20) - 1676usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmm21"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmm21) - 1740usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmm22"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmm22) - 1804usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmm23"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmm23) - 1868usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmm24"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmm24) - 1932usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmm25"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmm25) - 1996usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmm26"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmm26) - 2060usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmm27"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmm27) - 2124usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmm28"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmm28) - 2188usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmm29"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmm29) - 2252usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmm30"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmm30) - 2316usize];
    ["Offset of field: __darwin_x86_avx512_state64::__fpu_zmm31"]
        [::std::mem::offset_of!(__darwin_x86_avx512_state64, __fpu_zmm31) - 2380usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_x86_exception_state64 {
    pub __trapno: __uint16_t,
    pub __cpu: __uint16_t,
    pub __err: __uint32_t,
    pub __faultvaddr: __uint64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_x86_exception_state64"]
        [::std::mem::size_of::<__darwin_x86_exception_state64>() - 16usize];
    ["Alignment of __darwin_x86_exception_state64"]
        [::std::mem::align_of::<__darwin_x86_exception_state64>() - 8usize];
    ["Offset of field: __darwin_x86_exception_state64::__trapno"]
        [::std::mem::offset_of!(__darwin_x86_exception_state64, __trapno) - 0usize];
    ["Offset of field: __darwin_x86_exception_state64::__cpu"]
        [::std::mem::offset_of!(__darwin_x86_exception_state64, __cpu) - 2usize];
    ["Offset of field: __darwin_x86_exception_state64::__err"]
        [::std::mem::offset_of!(__darwin_x86_exception_state64, __err) - 4usize];
    ["Offset of field: __darwin_x86_exception_state64::__faultvaddr"]
        [::std::mem::offset_of!(__darwin_x86_exception_state64, __faultvaddr) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_x86_debug_state64 {
    pub __dr0: __uint64_t,
    pub __dr1: __uint64_t,
    pub __dr2: __uint64_t,
    pub __dr3: __uint64_t,
    pub __dr4: __uint64_t,
    pub __dr5: __uint64_t,
    pub __dr6: __uint64_t,
    pub __dr7: __uint64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_x86_debug_state64"]
        [::std::mem::size_of::<__darwin_x86_debug_state64>() - 64usize];
    ["Alignment of __darwin_x86_debug_state64"]
        [::std::mem::align_of::<__darwin_x86_debug_state64>() - 8usize];
    ["Offset of field: __darwin_x86_debug_state64::__dr0"]
        [::std::mem::offset_of!(__darwin_x86_debug_state64, __dr0) - 0usize];
    ["Offset of field: __darwin_x86_debug_state64::__dr1"]
        [::std::mem::offset_of!(__darwin_x86_debug_state64, __dr1) - 8usize];
    ["Offset of field: __darwin_x86_debug_state64::__dr2"]
        [::std::mem::offset_of!(__darwin_x86_debug_state64, __dr2) - 16usize];
    ["Offset of field: __darwin_x86_debug_state64::__dr3"]
        [::std::mem::offset_of!(__darwin_x86_debug_state64, __dr3) - 24usize];
    ["Offset of field: __darwin_x86_debug_state64::__dr4"]
        [::std::mem::offset_of!(__darwin_x86_debug_state64, __dr4) - 32usize];
    ["Offset of field: __darwin_x86_debug_state64::__dr5"]
        [::std::mem::offset_of!(__darwin_x86_debug_state64, __dr5) - 40usize];
    ["Offset of field: __darwin_x86_debug_state64::__dr6"]
        [::std::mem::offset_of!(__darwin_x86_debug_state64, __dr6) - 48usize];
    ["Offset of field: __darwin_x86_debug_state64::__dr7"]
        [::std::mem::offset_of!(__darwin_x86_debug_state64, __dr7) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_x86_cpmu_state64 {
    pub __ctrs: [__uint64_t; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_x86_cpmu_state64"]
        [::std::mem::size_of::<__darwin_x86_cpmu_state64>() - 128usize];
    ["Alignment of __darwin_x86_cpmu_state64"]
        [::std::mem::align_of::<__darwin_x86_cpmu_state64>() - 8usize];
    ["Offset of field: __darwin_x86_cpmu_state64::__ctrs"]
        [::std::mem::offset_of!(__darwin_x86_cpmu_state64, __ctrs) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_mcontext32 {
    pub __es: __darwin_i386_exception_state,
    pub __ss: __darwin_i386_thread_state,
    pub __fs: __darwin_i386_float_state,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_mcontext32"][::std::mem::size_of::<__darwin_mcontext32>() - 600usize];
    ["Alignment of __darwin_mcontext32"][::std::mem::align_of::<__darwin_mcontext32>() - 4usize];
    ["Offset of field: __darwin_mcontext32::__es"]
        [::std::mem::offset_of!(__darwin_mcontext32, __es) - 0usize];
    ["Offset of field: __darwin_mcontext32::__ss"]
        [::std::mem::offset_of!(__darwin_mcontext32, __ss) - 12usize];
    ["Offset of field: __darwin_mcontext32::__fs"]
        [::std::mem::offset_of!(__darwin_mcontext32, __fs) - 76usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_mcontext_avx32 {
    pub __es: __darwin_i386_exception_state,
    pub __ss: __darwin_i386_thread_state,
    pub __fs: __darwin_i386_avx_state,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_mcontext_avx32"]
        [::std::mem::size_of::<__darwin_mcontext_avx32>() - 792usize];
    ["Alignment of __darwin_mcontext_avx32"]
        [::std::mem::align_of::<__darwin_mcontext_avx32>() - 4usize];
    ["Offset of field: __darwin_mcontext_avx32::__es"]
        [::std::mem::offset_of!(__darwin_mcontext_avx32, __es) - 0usize];
    ["Offset of field: __darwin_mcontext_avx32::__ss"]
        [::std::mem::offset_of!(__darwin_mcontext_avx32, __ss) - 12usize];
    ["Offset of field: __darwin_mcontext_avx32::__fs"]
        [::std::mem::offset_of!(__darwin_mcontext_avx32, __fs) - 76usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_mcontext_avx512_32 {
    pub __es: __darwin_i386_exception_state,
    pub __ss: __darwin_i386_thread_state,
    pub __fs: __darwin_i386_avx512_state,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_mcontext_avx512_32"]
        [::std::mem::size_of::<__darwin_mcontext_avx512_32>() - 1112usize];
    ["Alignment of __darwin_mcontext_avx512_32"]
        [::std::mem::align_of::<__darwin_mcontext_avx512_32>() - 4usize];
    ["Offset of field: __darwin_mcontext_avx512_32::__es"]
        [::std::mem::offset_of!(__darwin_mcontext_avx512_32, __es) - 0usize];
    ["Offset of field: __darwin_mcontext_avx512_32::__ss"]
        [::std::mem::offset_of!(__darwin_mcontext_avx512_32, __ss) - 12usize];
    ["Offset of field: __darwin_mcontext_avx512_32::__fs"]
        [::std::mem::offset_of!(__darwin_mcontext_avx512_32, __fs) - 76usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_mcontext64 {
    pub __es: __darwin_x86_exception_state64,
    pub __ss: __darwin_x86_thread_state64,
    pub __fs: __darwin_x86_float_state64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_mcontext64"][::std::mem::size_of::<__darwin_mcontext64>() - 712usize];
    ["Alignment of __darwin_mcontext64"][::std::mem::align_of::<__darwin_mcontext64>() - 8usize];
    ["Offset of field: __darwin_mcontext64::__es"]
        [::std::mem::offset_of!(__darwin_mcontext64, __es) - 0usize];
    ["Offset of field: __darwin_mcontext64::__ss"]
        [::std::mem::offset_of!(__darwin_mcontext64, __ss) - 16usize];
    ["Offset of field: __darwin_mcontext64::__fs"]
        [::std::mem::offset_of!(__darwin_mcontext64, __fs) - 184usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_mcontext64_full {
    pub __es: __darwin_x86_exception_state64,
    pub __ss: __darwin_x86_thread_full_state64,
    pub __fs: __darwin_x86_float_state64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_mcontext64_full"]
        [::std::mem::size_of::<__darwin_mcontext64_full>() - 744usize];
    ["Alignment of __darwin_mcontext64_full"]
        [::std::mem::align_of::<__darwin_mcontext64_full>() - 8usize];
    ["Offset of field: __darwin_mcontext64_full::__es"]
        [::std::mem::offset_of!(__darwin_mcontext64_full, __es) - 0usize];
    ["Offset of field: __darwin_mcontext64_full::__ss"]
        [::std::mem::offset_of!(__darwin_mcontext64_full, __ss) - 16usize];
    ["Offset of field: __darwin_mcontext64_full::__fs"]
        [::std::mem::offset_of!(__darwin_mcontext64_full, __fs) - 216usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_mcontext_avx64 {
    pub __es: __darwin_x86_exception_state64,
    pub __ss: __darwin_x86_thread_state64,
    pub __fs: __darwin_x86_avx_state64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_mcontext_avx64"]
        [::std::mem::size_of::<__darwin_mcontext_avx64>() - 1032usize];
    ["Alignment of __darwin_mcontext_avx64"]
        [::std::mem::align_of::<__darwin_mcontext_avx64>() - 8usize];
    ["Offset of field: __darwin_mcontext_avx64::__es"]
        [::std::mem::offset_of!(__darwin_mcontext_avx64, __es) - 0usize];
    ["Offset of field: __darwin_mcontext_avx64::__ss"]
        [::std::mem::offset_of!(__darwin_mcontext_avx64, __ss) - 16usize];
    ["Offset of field: __darwin_mcontext_avx64::__fs"]
        [::std::mem::offset_of!(__darwin_mcontext_avx64, __fs) - 184usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_mcontext_avx64_full {
    pub __es: __darwin_x86_exception_state64,
    pub __ss: __darwin_x86_thread_full_state64,
    pub __fs: __darwin_x86_avx_state64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_mcontext_avx64_full"]
        [::std::mem::size_of::<__darwin_mcontext_avx64_full>() - 1064usize];
    ["Alignment of __darwin_mcontext_avx64_full"]
        [::std::mem::align_of::<__darwin_mcontext_avx64_full>() - 8usize];
    ["Offset of field: __darwin_mcontext_avx64_full::__es"]
        [::std::mem::offset_of!(__darwin_mcontext_avx64_full, __es) - 0usize];
    ["Offset of field: __darwin_mcontext_avx64_full::__ss"]
        [::std::mem::offset_of!(__darwin_mcontext_avx64_full, __ss) - 16usize];
    ["Offset of field: __darwin_mcontext_avx64_full::__fs"]
        [::std::mem::offset_of!(__darwin_mcontext_avx64_full, __fs) - 216usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_mcontext_avx512_64 {
    pub __es: __darwin_x86_exception_state64,
    pub __ss: __darwin_x86_thread_state64,
    pub __fs: __darwin_x86_avx512_state64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_mcontext_avx512_64"]
        [::std::mem::size_of::<__darwin_mcontext_avx512_64>() - 2632usize];
    ["Alignment of __darwin_mcontext_avx512_64"]
        [::std::mem::align_of::<__darwin_mcontext_avx512_64>() - 8usize];
    ["Offset of field: __darwin_mcontext_avx512_64::__es"]
        [::std::mem::offset_of!(__darwin_mcontext_avx512_64, __es) - 0usize];
    ["Offset of field: __darwin_mcontext_avx512_64::__ss"]
        [::std::mem::offset_of!(__darwin_mcontext_avx512_64, __ss) - 16usize];
    ["Offset of field: __darwin_mcontext_avx512_64::__fs"]
        [::std::mem::offset_of!(__darwin_mcontext_avx512_64, __fs) - 184usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_mcontext_avx512_64_full {
    pub __es: __darwin_x86_exception_state64,
    pub __ss: __darwin_x86_thread_full_state64,
    pub __fs: __darwin_x86_avx512_state64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_mcontext_avx512_64_full"]
        [::std::mem::size_of::<__darwin_mcontext_avx512_64_full>() - 2664usize];
    ["Alignment of __darwin_mcontext_avx512_64_full"]
        [::std::mem::align_of::<__darwin_mcontext_avx512_64_full>() - 8usize];
    ["Offset of field: __darwin_mcontext_avx512_64_full::__es"]
        [::std::mem::offset_of!(__darwin_mcontext_avx512_64_full, __es) - 0usize];
    ["Offset of field: __darwin_mcontext_avx512_64_full::__ss"]
        [::std::mem::offset_of!(__darwin_mcontext_avx512_64_full, __ss) - 16usize];
    ["Offset of field: __darwin_mcontext_avx512_64_full::__fs"]
        [::std::mem::offset_of!(__darwin_mcontext_avx512_64_full, __fs) - 216usize];
};
pub type mcontext_t = *mut __darwin_mcontext64;
pub type pthread_attr_t = __darwin_pthread_attr_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_sigaltstack {
    pub ss_sp: *mut ::std::os::raw::c_void,
    pub ss_size: __darwin_size_t,
    pub ss_flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_sigaltstack"][::std::mem::size_of::<__darwin_sigaltstack>() - 24usize];
    ["Alignment of __darwin_sigaltstack"][::std::mem::align_of::<__darwin_sigaltstack>() - 8usize];
    ["Offset of field: __darwin_sigaltstack::ss_sp"]
        [::std::mem::offset_of!(__darwin_sigaltstack, ss_sp) - 0usize];
    ["Offset of field: __darwin_sigaltstack::ss_size"]
        [::std::mem::offset_of!(__darwin_sigaltstack, ss_size) - 8usize];
    ["Offset of field: __darwin_sigaltstack::ss_flags"]
        [::std::mem::offset_of!(__darwin_sigaltstack, ss_flags) - 16usize];
};
pub type stack_t = __darwin_sigaltstack;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_ucontext {
    pub uc_onstack: ::std::os::raw::c_int,
    pub uc_sigmask: __darwin_sigset_t,
    pub uc_stack: __darwin_sigaltstack,
    pub uc_link: *mut __darwin_ucontext,
    pub uc_mcsize: __darwin_size_t,
    pub uc_mcontext: *mut __darwin_mcontext64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __darwin_ucontext"][::std::mem::size_of::<__darwin_ucontext>() - 56usize];
    ["Alignment of __darwin_ucontext"][::std::mem::align_of::<__darwin_ucontext>() - 8usize];
    ["Offset of field: __darwin_ucontext::uc_onstack"]
        [::std::mem::offset_of!(__darwin_ucontext, uc_onstack) - 0usize];
    ["Offset of field: __darwin_ucontext::uc_sigmask"]
        [::std::mem::offset_of!(__darwin_ucontext, uc_sigmask) - 4usize];
    ["Offset of field: __darwin_ucontext::uc_stack"]
        [::std::mem::offset_of!(__darwin_ucontext, uc_stack) - 8usize];
    ["Offset of field: __darwin_ucontext::uc_link"]
        [::std::mem::offset_of!(__darwin_ucontext, uc_link) - 32usize];
    ["Offset of field: __darwin_ucontext::uc_mcsize"]
        [::std::mem::offset_of!(__darwin_ucontext, uc_mcsize) - 40usize];
    ["Offset of field: __darwin_ucontext::uc_mcontext"]
        [::std::mem::offset_of!(__darwin_ucontext, uc_mcontext) - 48usize];
};
pub type ucontext_t = __darwin_ucontext;
pub type pid_t = __darwin_pid_t;
pub type sigset_t = __darwin_sigset_t;
pub type uid_t = __darwin_uid_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union sigval {
    pub sival_int: ::std::os::raw::c_int,
    pub sival_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigval"][::std::mem::size_of::<sigval>() - 8usize];
    ["Alignment of sigval"][::std::mem::align_of::<sigval>() - 8usize];
    ["Offset of field: sigval::sival_int"][::std::mem::offset_of!(sigval, sival_int) - 0usize];
    ["Offset of field: sigval::sival_ptr"][::std::mem::offset_of!(sigval, sival_ptr) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sigevent {
    pub sigev_notify: ::std::os::raw::c_int,
    pub sigev_signo: ::std::os::raw::c_int,
    pub sigev_value: sigval,
    pub sigev_notify_function: ::std::option::Option<unsafe extern "C" fn(arg1: sigval)>,
    pub sigev_notify_attributes: *mut pthread_attr_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigevent"][::std::mem::size_of::<sigevent>() - 32usize];
    ["Alignment of sigevent"][::std::mem::align_of::<sigevent>() - 8usize];
    ["Offset of field: sigevent::sigev_notify"]
        [::std::mem::offset_of!(sigevent, sigev_notify) - 0usize];
    ["Offset of field: sigevent::sigev_signo"]
        [::std::mem::offset_of!(sigevent, sigev_signo) - 4usize];
    ["Offset of field: sigevent::sigev_value"]
        [::std::mem::offset_of!(sigevent, sigev_value) - 8usize];
    ["Offset of field: sigevent::sigev_notify_function"]
        [::std::mem::offset_of!(sigevent, sigev_notify_function) - 16usize];
    ["Offset of field: sigevent::sigev_notify_attributes"]
        [::std::mem::offset_of!(sigevent, sigev_notify_attributes) - 24usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __siginfo {
    pub si_signo: ::std::os::raw::c_int,
    pub si_errno: ::std::os::raw::c_int,
    pub si_code: ::std::os::raw::c_int,
    pub si_pid: pid_t,
    pub si_uid: uid_t,
    pub si_status: ::std::os::raw::c_int,
    pub si_addr: *mut ::std::os::raw::c_void,
    pub si_value: sigval,
    pub si_band: ::std::os::raw::c_long,
    pub __pad: [::std::os::raw::c_ulong; 7usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __siginfo"][::std::mem::size_of::<__siginfo>() - 104usize];
    ["Alignment of __siginfo"][::std::mem::align_of::<__siginfo>() - 8usize];
    ["Offset of field: __siginfo::si_signo"][::std::mem::offset_of!(__siginfo, si_signo) - 0usize];
    ["Offset of field: __siginfo::si_errno"][::std::mem::offset_of!(__siginfo, si_errno) - 4usize];
    ["Offset of field: __siginfo::si_code"][::std::mem::offset_of!(__siginfo, si_code) - 8usize];
    ["Offset of field: __siginfo::si_pid"][::std::mem::offset_of!(__siginfo, si_pid) - 12usize];
    ["Offset of field: __siginfo::si_uid"][::std::mem::offset_of!(__siginfo, si_uid) - 16usize];
    ["Offset of field: __siginfo::si_status"]
        [::std::mem::offset_of!(__siginfo, si_status) - 20usize];
    ["Offset of field: __siginfo::si_addr"][::std::mem::offset_of!(__siginfo, si_addr) - 24usize];
    ["Offset of field: __siginfo::si_value"][::std::mem::offset_of!(__siginfo, si_value) - 32usize];
    ["Offset of field: __siginfo::si_band"][::std::mem::offset_of!(__siginfo, si_band) - 40usize];
    ["Offset of field: __siginfo::__pad"][::std::mem::offset_of!(__siginfo, __pad) - 48usize];
};
pub type siginfo_t = __siginfo;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __sigaction_u {
    pub __sa_handler: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
    pub __sa_sigaction: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: *mut __siginfo,
            arg3: *mut ::std::os::raw::c_void,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigaction_u"][::std::mem::size_of::<__sigaction_u>() - 8usize];
    ["Alignment of __sigaction_u"][::std::mem::align_of::<__sigaction_u>() - 8usize];
    ["Offset of field: __sigaction_u::__sa_handler"]
        [::std::mem::offset_of!(__sigaction_u, __sa_handler) - 0usize];
    ["Offset of field: __sigaction_u::__sa_sigaction"]
        [::std::mem::offset_of!(__sigaction_u, __sa_sigaction) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __sigaction {
    pub __sigaction_u: __sigaction_u,
    pub sa_tramp: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: ::std::os::raw::c_int,
            arg3: ::std::os::raw::c_int,
            arg4: *mut siginfo_t,
            arg5: *mut ::std::os::raw::c_void,
        ),
    >,
    pub sa_mask: sigset_t,
    pub sa_flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigaction"][::std::mem::size_of::<__sigaction>() - 24usize];
    ["Alignment of __sigaction"][::std::mem::align_of::<__sigaction>() - 8usize];
    ["Offset of field: __sigaction::__sigaction_u"]
        [::std::mem::offset_of!(__sigaction, __sigaction_u) - 0usize];
    ["Offset of field: __sigaction::sa_tramp"]
        [::std::mem::offset_of!(__sigaction, sa_tramp) - 8usize];
    ["Offset of field: __sigaction::sa_mask"]
        [::std::mem::offset_of!(__sigaction, sa_mask) - 16usize];
    ["Offset of field: __sigaction::sa_flags"]
        [::std::mem::offset_of!(__sigaction, sa_flags) - 20usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sigaction {
    pub __sigaction_u: __sigaction_u,
    pub sa_mask: sigset_t,
    pub sa_flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigaction"][::std::mem::size_of::<sigaction>() - 16usize];
    ["Alignment of sigaction"][::std::mem::align_of::<sigaction>() - 8usize];
    ["Offset of field: sigaction::__sigaction_u"]
        [::std::mem::offset_of!(sigaction, __sigaction_u) - 0usize];
    ["Offset of field: sigaction::sa_mask"][::std::mem::offset_of!(sigaction, sa_mask) - 8usize];
    ["Offset of field: sigaction::sa_flags"][::std::mem::offset_of!(sigaction, sa_flags) - 12usize];
};
pub type sig_t = ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigvec {
    pub sv_handler: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
    pub sv_mask: ::std::os::raw::c_int,
    pub sv_flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigvec"][::std::mem::size_of::<sigvec>() - 16usize];
    ["Alignment of sigvec"][::std::mem::align_of::<sigvec>() - 8usize];
    ["Offset of field: sigvec::sv_handler"][::std::mem::offset_of!(sigvec, sv_handler) - 0usize];
    ["Offset of field: sigvec::sv_mask"][::std::mem::offset_of!(sigvec, sv_mask) - 8usize];
    ["Offset of field: sigvec::sv_flags"][::std::mem::offset_of!(sigvec, sv_flags) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigstack {
    pub ss_sp: *mut ::std::os::raw::c_char,
    pub ss_onstack: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigstack"][::std::mem::size_of::<sigstack>() - 16usize];
    ["Alignment of sigstack"][::std::mem::align_of::<sigstack>() - 8usize];
    ["Offset of field: sigstack::ss_sp"][::std::mem::offset_of!(sigstack, ss_sp) - 0usize];
    ["Offset of field: sigstack::ss_onstack"]
        [::std::mem::offset_of!(sigstack, ss_onstack) - 8usize];
};
unsafe extern "C" {
    pub fn signal(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
    ) -> ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
        ),
    >;
}
pub type pthread_t = __darwin_pthread_t;
unsafe extern "C" {
    pub static sys_signame: [*const ::std::os::raw::c_char; 32usize];
}
unsafe extern "C" {
    pub static sys_siglist: [*const ::std::os::raw::c_char; 32usize];
}
unsafe extern "C" {
    pub fn raise(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn bsd_signal(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
    ) -> ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
        ),
    >;
}
unsafe extern "C" {
    pub fn kill(arg1: pid_t, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn killpg(arg1: pid_t, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_kill(arg1: pthread_t, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_sigmask(
        arg1: ::std::os::raw::c_int,
        arg2: *const sigset_t,
        arg3: *mut sigset_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sigaction(
        arg1: ::std::os::raw::c_int,
        arg2: *const sigaction,
        arg3: *mut sigaction,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sigaddset(arg1: *mut sigset_t, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sigaltstack(arg1: *const stack_t, arg2: *mut stack_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sigdelset(arg1: *mut sigset_t, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sigemptyset(arg1: *mut sigset_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sigfillset(arg1: *mut sigset_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sighold(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sigignore(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn siginterrupt(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sigismember(arg1: *const sigset_t, arg2: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sigpause(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sigpending(arg1: *mut sigset_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sigprocmask(
        arg1: ::std::os::raw::c_int,
        arg2: *const sigset_t,
        arg3: *mut sigset_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sigrelse(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sigset(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
    ) -> ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>,
        ),
    >;
}
unsafe extern "C" {
    pub fn sigsuspend(arg1: *const sigset_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sigwait(
        arg1: *const sigset_t,
        arg2: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn psignal(arg1: ::std::os::raw::c_int, arg2: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn sigblock(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sigsetmask(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sigvec(
        arg1: ::std::os::raw::c_int,
        arg2: *mut sigvec,
        arg3: *mut sigvec,
    ) -> ::std::os::raw::c_int;
}
pub type GoInt8 = ::std::os::raw::c_schar;
pub type GoUint8 = ::std::os::raw::c_uchar;
pub type GoInt16 = ::std::os::raw::c_short;
pub type GoUint16 = ::std::os::raw::c_ushort;
pub type GoInt32 = ::std::os::raw::c_int;
pub type GoUint32 = ::std::os::raw::c_uint;
pub type GoInt64 = ::std::os::raw::c_longlong;
pub type GoUint64 = ::std::os::raw::c_ulonglong;
pub type GoInt = GoInt64;
pub type GoUint = GoUint64;
pub type GoUintptr = usize;
pub type GoFloat32 = f32;
pub type GoFloat64 = f64;
pub type GoComplex64 = __BindgenComplex<f32>;
pub type GoComplex128 = __BindgenComplex<f64>;
pub type _check_for_64_bit_pointer_matching_GoInt = [::std::os::raw::c_char; 1usize];
pub type GoString = _GoString_;
pub type GoMap = *mut ::std::os::raw::c_void;
pub type GoChan = *mut ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GoInterface {
    pub t: *mut ::std::os::raw::c_void,
    pub v: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GoInterface"][::std::mem::size_of::<GoInterface>() - 16usize];
    ["Alignment of GoInterface"][::std::mem::align_of::<GoInterface>() - 8usize];
    ["Offset of field: GoInterface::t"][::std::mem::offset_of!(GoInterface, t) - 0usize];
    ["Offset of field: GoInterface::v"][::std::mem::offset_of!(GoInterface, v) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GoSlice {
    pub data: *mut ::std::os::raw::c_void,
    pub len: GoInt,
    pub cap: GoInt,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of GoSlice"][::std::mem::size_of::<GoSlice>() - 24usize];
    ["Alignment of GoSlice"][::std::mem::align_of::<GoSlice>() - 8usize];
    ["Offset of field: GoSlice::data"][::std::mem::offset_of!(GoSlice, data) - 0usize];
    ["Offset of field: GoSlice::len"][::std::mem::offset_of!(GoSlice, len) - 8usize];
    ["Offset of field: GoSlice::cap"][::std::mem::offset_of!(GoSlice, cap) - 16usize];
};
unsafe extern "C" {
    pub fn KD_Initialize(
        relayURL: *mut ::std::os::raw::c_char,
        inbound: ::std::os::raw::c_int,
        outbound: ::std::os::raw::c_int,
        toMount: *mut ::std::os::raw::c_char,
        toSave: *mut ::std::os::raw::c_char,
        useFUSE: ::std::os::raw::c_int,
        prefetchOnOpen: ::std::os::raw::c_int,
        pushOnWrite: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_CreateRoom() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_JoinRoom() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_Connect() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_AddPeerFingerprint(fp: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_GetPeerFingerprint() -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn KD_AddFile(path: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_AddFileAs(
        localPath: *mut ::std::os::raw::c_char,
        remoteName: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_ListFiles() -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn KD_PullFile(
        remote: *mut ::std::os::raw::c_char,
        local: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_Fingerprint() -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn KD_UnmountFilesystem();
}
unsafe extern "C" {
    pub fn KD_Disconnect();
}
unsafe extern "C" {
    pub fn KD_Stop();
}
unsafe extern "C" {
    pub fn KD_CancelDownload(remoteName: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_GetDownloadProgress(remoteName: *mut ::std::os::raw::c_char)
        -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_PrintBanner();
}
unsafe extern "C" {
    pub fn KD_GetFileCount() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_GetFileName(index: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn KD_GetLocalFileCount() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_GetLocalFileName(index: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn KD_GetFileSize(index: ::std::os::raw::c_int) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn KD_GetFileSizeByName(name: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn KD_GetLocalFileRealPath(
        name: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn KD_GetConnectionStatus() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_SaveFileAt(
        index: ::std::os::raw::c_int,
        localPath: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_SaveFileByName(
        name: *mut ::std::os::raw::c_char,
        localPath: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_GetLastError() -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn KD_GetLastErrorAndClear() -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn KD_PollEvent() -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn KD_SetupEventCallbacks();
}
unsafe extern "C" {
    pub fn KD_SetFUSEMode(useFUSE: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn KD_GetFUSEMode() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_SetLocalMode(enabled: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn KD_GetLocalMode() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_GetLinkLocalAddress() -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn KD_SetPeerDirectAddress(addr: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_StartDiscovery();
}
unsafe extern "C" {
    pub fn KD_StopDiscovery();
}
unsafe extern "C" {
    pub fn KD_GetDiscoveryName() -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn KD_GetDiscoveredPeerCount() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_GetDiscoveredPeerName(i: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn KD_GetDiscoveredPeerAddr(i: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn KD_GetConnectionMode() -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn KD_SetStrictMode(enabled: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn KD_GetVersion() -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn KD_GetLogPath() -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn KD_GetConfigPath() -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn KD_GetConfig() -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn KD_SaveConfig(
        relay: *mut ::std::os::raw::c_char,
        savePath: *mut ::std::os::raw::c_char,
        mountPath: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_SanitizeLogs(destPath: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_IsIncognito() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_SetIncognito(v: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn KD_SetPassphraseProtect(v: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn KD_IsPeerAlreadyContact() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_IsPeerPersistent() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_GetContactCount() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_GetContactName(index: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn KD_GetContactFingerprint(index: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn KD_AddContact(
        name: *mut ::std::os::raw::c_char,
        fingerprint: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_RemoveContact(fingerprint: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_ConnectToContact(fingerprint: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_GetContactOnline(index: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn KD_SaveCurrentPeerAsContact(name: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
pub type __builtin_va_list = [__va_list_tag; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __va_list_tag {
    pub gp_offset: ::std::os::raw::c_uint,
    pub fp_offset: ::std::os::raw::c_uint,
    pub overflow_arg_area: *mut ::std::os::raw::c_void,
    pub reg_save_area: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __va_list_tag"][::std::mem::size_of::<__va_list_tag>() - 24usize];
    ["Alignment of __va_list_tag"][::std::mem::align_of::<__va_list_tag>() - 8usize];
    ["Offset of field: __va_list_tag::gp_offset"]
        [::std::mem::offset_of!(__va_list_tag, gp_offset) - 0usize];
    ["Offset of field: __va_list_tag::fp_offset"]
        [::std::mem::offset_of!(__va_list_tag, fp_offset) - 4usize];
    ["Offset of field: __va_list_tag::overflow_arg_area"]
        [::std::mem::offset_of!(__va_list_tag, overflow_arg_area) - 8usize];
    ["Offset of field: __va_list_tag::reg_save_area"]
        [::std::mem::offset_of!(__va_list_tag, reg_save_area) - 16usize];
};
