/* automatically generated by rust-bindgen 0.69.5 */

#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
#![allow(dead_code)]

# [derive (PartialEq , Copy , Clone , Hash , Debug , Default)] # [repr (C)] pub struct __BindgenComplex < T > { pub re : T , pub im : T } pub type wchar_t = :: std :: os :: raw :: c_ushort ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct max_align_t { pub __clang_max_align_nonce1 : :: std :: os :: raw :: c_longlong , pub __clang_max_align_nonce2 : f64 , } # [test] fn bindgen_test_layout_max_align_t () { const UNINIT : :: std :: mem :: MaybeUninit < max_align_t > = :: std :: mem :: MaybeUninit :: uninit () ; let ptr = UNINIT . as_ptr () ; assert_eq ! (:: std :: mem :: size_of :: < max_align_t > () , 16usize , concat ! ("Size of: " , stringify ! (max_align_t))) ; assert_eq ! (:: std :: mem :: align_of :: < max_align_t > () , 8usize , concat ! ("Alignment of " , stringify ! (max_align_t))) ; assert_eq ! (unsafe { :: std :: ptr :: addr_of ! ((* ptr) . __clang_max_align_nonce1) as usize - ptr as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (max_align_t) , "::" , stringify ! (__clang_max_align_nonce1))) ; assert_eq ! (unsafe { :: std :: ptr :: addr_of ! ((* ptr) . __clang_max_align_nonce2) as usize - ptr as usize } , 8usize , concat ! ("Offset of field: " , stringify ! (max_align_t) , "::" , stringify ! (__clang_max_align_nonce2))) ; } # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct _GoString_ { pub p : * const :: std :: os :: raw :: c_char , pub n : isize , } # [test] fn bindgen_test_layout__GoString_ () { const UNINIT : :: std :: mem :: MaybeUninit < _GoString_ > = :: std :: mem :: MaybeUninit :: uninit () ; let ptr = UNINIT . as_ptr () ; assert_eq ! (:: std :: mem :: size_of :: < _GoString_ > () , 16usize , concat ! ("Size of: " , stringify ! (_GoString_))) ; assert_eq ! (:: std :: mem :: align_of :: < _GoString_ > () , 8usize , concat ! ("Alignment of " , stringify ! (_GoString_))) ; assert_eq ! (unsafe { :: std :: ptr :: addr_of ! ((* ptr) . p) as usize - ptr as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (_GoString_) , "::" , stringify ! (p))) ; assert_eq ! (unsafe { :: std :: ptr :: addr_of ! ((* ptr) . n) as usize - ptr as usize } , 8usize , concat ! ("Offset of field: " , stringify ! (_GoString_) , "::" , stringify ! (n))) ; } extern "C" { pub fn _GoStringLen (s : _GoString_) -> usize ; } extern "C" { pub fn _GoStringPtr (s : _GoString_) -> * const :: std :: os :: raw :: c_char ; } pub type int_least64_t = i64 ; pub type uint_least64_t = u64 ; pub type int_fast64_t = i64 ; pub type uint_fast64_t = u64 ; pub type int_least32_t = i32 ; pub type uint_least32_t = u32 ; pub type int_fast32_t = i32 ; pub type uint_fast32_t = u32 ; pub type int_least16_t = i16 ; pub type uint_least16_t = u16 ; pub type int_fast16_t = i16 ; pub type uint_fast16_t = u16 ; pub type int_least8_t = i8 ; pub type uint_least8_t = u8 ; pub type int_fast8_t = i8 ; pub type uint_fast8_t = u8 ; pub type intmax_t = :: std :: os :: raw :: c_longlong ; pub type uintmax_t = :: std :: os :: raw :: c_ulonglong ; pub type GoInt8 = :: std :: os :: raw :: c_schar ; pub type GoUint8 = :: std :: os :: raw :: c_uchar ; pub type GoInt16 = :: std :: os :: raw :: c_short ; pub type GoUint16 = :: std :: os :: raw :: c_ushort ; pub type GoInt32 = :: std :: os :: raw :: c_int ; pub type GoUint32 = :: std :: os :: raw :: c_uint ; pub type GoInt64 = :: std :: os :: raw :: c_longlong ; pub type GoUint64 = :: std :: os :: raw :: c_ulonglong ; pub type GoInt = GoInt64 ; pub type GoUint = GoUint64 ; pub type GoUintptr = usize ; pub type GoFloat32 = f32 ; pub type GoFloat64 = f64 ; pub type GoComplex64 = __BindgenComplex < f32 > ; pub type GoComplex128 = __BindgenComplex < f64 > ; pub type _check_for_64_bit_pointer_matching_GoInt = [:: std :: os :: raw :: c_char ; 1usize] ; pub type GoString = _GoString_ ; pub type GoMap = * mut :: std :: os :: raw :: c_void ; pub type GoChan = * mut :: std :: os :: raw :: c_void ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct GoInterface { pub t : * mut :: std :: os :: raw :: c_void , pub v : * mut :: std :: os :: raw :: c_void , } # [test] fn bindgen_test_layout_GoInterface () { const UNINIT : :: std :: mem :: MaybeUninit < GoInterface > = :: std :: mem :: MaybeUninit :: uninit () ; let ptr = UNINIT . as_ptr () ; assert_eq ! (:: std :: mem :: size_of :: < GoInterface > () , 16usize , concat ! ("Size of: " , stringify ! (GoInterface))) ; assert_eq ! (:: std :: mem :: align_of :: < GoInterface > () , 8usize , concat ! ("Alignment of " , stringify ! (GoInterface))) ; assert_eq ! (unsafe { :: std :: ptr :: addr_of ! ((* ptr) . t) as usize - ptr as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (GoInterface) , "::" , stringify ! (t))) ; assert_eq ! (unsafe { :: std :: ptr :: addr_of ! ((* ptr) . v) as usize - ptr as usize } , 8usize , concat ! ("Offset of field: " , stringify ! (GoInterface) , "::" , stringify ! (v))) ; } # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct GoSlice { pub data : * mut :: std :: os :: raw :: c_void , pub len : GoInt , pub cap : GoInt , } # [test] fn bindgen_test_layout_GoSlice () { const UNINIT : :: std :: mem :: MaybeUninit < GoSlice > = :: std :: mem :: MaybeUninit :: uninit () ; let ptr = UNINIT . as_ptr () ; assert_eq ! (:: std :: mem :: size_of :: < GoSlice > () , 24usize , concat ! ("Size of: " , stringify ! (GoSlice))) ; assert_eq ! (:: std :: mem :: align_of :: < GoSlice > () , 8usize , concat ! ("Alignment of " , stringify ! (GoSlice))) ; assert_eq ! (unsafe { :: std :: ptr :: addr_of ! ((* ptr) . data) as usize - ptr as usize } , 0usize , concat ! ("Offset of field: " , stringify ! (GoSlice) , "::" , stringify ! (data))) ; assert_eq ! (unsafe { :: std :: ptr :: addr_of ! ((* ptr) . len) as usize - ptr as usize } , 8usize , concat ! ("Offset of field: " , stringify ! (GoSlice) , "::" , stringify ! (len))) ; assert_eq ! (unsafe { :: std :: ptr :: addr_of ! ((* ptr) . cap) as usize - ptr as usize } , 16usize , concat ! ("Offset of field: " , stringify ! (GoSlice) , "::" , stringify ! (cap))) ; } extern "C" { pub fn KD_Initialize (relayURL : * mut :: std :: os :: raw :: c_char , inbound : :: std :: os :: raw :: c_int , outbound : :: std :: os :: raw :: c_int , toMount : * mut :: std :: os :: raw :: c_char , toSave : * mut :: std :: os :: raw :: c_char , useFUSE : :: std :: os :: raw :: c_int , prefetchOnOpen : :: std :: os :: raw :: c_int , pushOnWrite : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_int ; } extern "C" { pub fn KD_CreateRoom () -> :: std :: os :: raw :: c_int ; } extern "C" { pub fn KD_JoinRoom () -> :: std :: os :: raw :: c_int ; } extern "C" { pub fn KD_AddPeerFingerprint (fp : * mut :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } extern "C" { pub fn KD_GetPeerFingerprint () -> * mut :: std :: os :: raw :: c_char ; } extern "C" { pub fn KD_AddFile (path : * mut :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } extern "C" { pub fn KD_ListFiles () -> * mut :: std :: os :: raw :: c_char ; } extern "C" { pub fn KD_PullFile (remote : * mut :: std :: os :: raw :: c_char , local : * mut :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } extern "C" { pub fn KD_Fingerprint () -> * mut :: std :: os :: raw :: c_char ; } extern "C" { pub fn KD_UnmountFilesystem () ; } extern "C" { pub fn KD_Disconnect () ; } extern "C" { pub fn KD_Stop () ; } extern "C" { pub fn KD_CancelDownload (remoteName : * mut :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } extern "C" { pub fn KD_GetDownloadProgress (remoteName : * mut :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } extern "C" { pub fn KD_PrintBanner () ; } extern "C" { pub fn KD_GetFileCount () -> :: std :: os :: raw :: c_int ; } extern "C" { pub fn KD_GetFileName (index : :: std :: os :: raw :: c_int) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { pub fn KD_GetLocalFileCount () -> :: std :: os :: raw :: c_int ; } extern "C" { pub fn KD_GetLocalFileName (index : :: std :: os :: raw :: c_int) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { pub fn KD_GetFileSize (index : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_long ; } extern "C" { pub fn KD_GetFileSizeByName (name : * mut :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_long ; } extern "C" { pub fn KD_GetLocalFileRealPath (name : * mut :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ; } extern "C" { pub fn KD_GetConnectionStatus () -> :: std :: os :: raw :: c_int ; } extern "C" { pub fn KD_SaveFileAt (index : :: std :: os :: raw :: c_int , localPath : * mut :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } extern "C" { pub fn KD_SaveFileByName (name : * mut :: std :: os :: raw :: c_char , localPath : * mut :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } extern "C" { pub fn KD_GetLastError () -> * mut :: std :: os :: raw :: c_char ; } extern "C" { pub fn KD_GetLastErrorAndClear () -> * mut :: std :: os :: raw :: c_char ; } extern "C" { pub fn KD_PollEvent () -> * mut :: std :: os :: raw :: c_char ; } extern "C" { pub fn KD_SetupEventCallbacks () ; } extern "C" { pub fn KD_SetFUSEMode (useFUSE : :: std :: os :: raw :: c_int) ; } extern "C" { pub fn KD_GetFUSEMode () -> :: std :: os :: raw :: c_int ; } extern "C" { pub fn KD_SetLocalMode (enabled : :: std :: os :: raw :: c_int) ; } extern "C" { pub fn KD_GetLocalMode () -> :: std :: os :: raw :: c_int ; } extern "C" { pub fn KD_GetLinkLocalAddress () -> * mut :: std :: os :: raw :: c_char ; } extern "C" { pub fn KD_SetPeerDirectAddress (addr : * mut :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } extern "C" { pub fn KD_GetVersion () -> * mut :: std :: os :: raw :: c_char ; } extern "C" { pub fn KD_GetLogPath () -> * mut :: std :: os :: raw :: c_char ; } extern "C" { pub fn KD_GetConfigPath () -> * mut :: std :: os :: raw :: c_char ; }